[
    {
        "id":1,
        "name":"Gourmet Mushroom Risotto",
        "instructions":"In a saucepan, warm the broth over low heat. Warm 2 tablespoons olive oil in a large saucepan over medium-high heat. Stir in the mushrooms, and cook until soft, about 3 minutes. Remove mushrooms and their liquid, and set aside. Add 1 tablespoon olive oil to skillet,  and stir in the shallots. Cook 1 minute. Add rice, stirring to coat with oil, about 2 minutes. When the rice has taken on a pale, golden color, pour in wine, stirring constantly until the wine is fully absorbed. Add 1\/2 cup broth to the rice, and stir until the broth is absorbed. Continue adding broth 1\/2 cup at a time, stirring continuously, until the liquid is absorbed and the rice is al dente, about 15 to 20 minutes. Remove from heat, and stir in mushrooms with their liquid, butter, chives, and parmesan. Season with salt and pepper to taste.",
        "creatorId":-1
    },
    {
        "id":2,
        "name":"Dessert Crepes",
        "instructions":"In large bowl, whisk together eggs, milk, melted butter, flour sugar and salt until smooth. Heat a medium-sized skillet or crepe pan over medium heat. Grease pan with a small amount of butter or oil applied with a brush or paper towel.  Using a serving spoon or small ladle, spoon about 3 tablespoons crepe batter into hot pan, tilting the pan so that bottom surface is evenly coated.  Cook over medium heat, 1 to 2 minutes on a side, or until golden brown.  Serve immediately.",
        "creatorId":-1
    },
    {
        "id":3,
        "name":"Quick and Easy Pizza Crust",
        "instructions":"Preheat oven to 450 degrees F (230 degrees C). In a medium bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes. Stir in flour, salt and oil. Beat until smooth. Let rest for 5 minutes. Turn dough out onto a lightly floured surface and pat or roll into a round. Transfer crust to a lightly greased pizza pan or baker's peel dusted with cornmeal. Spread with desired toppings and bake in preheated oven for 15 to 20 minutes, or until golden brown. Let baked pizza cool for 5 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":4,
        "name":"Chicken Parmesan",
        "instructions":"Preheat an oven to 450 degrees F (230 degrees C). Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1\/2-inch. Season chicken thoroughly with salt and pepper. Beat eggs in a shallow bowl and set aside. Mix bread crumbs and 1\/2 cup Parmesan cheese in a separate bowl, set aside. Place flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides. Dip flour coated chicken breast in beaten eggs. Transfer breast to breadcrumb mixture, pressing the crumbs into both sides. Repeat for each breast. Set aside breaded chicken breasts for about 15 minutes. Heat 1 cup olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken until golden, about 2 minutes on each side. The chicken will finish cooking in the oven. Place chicken in a baking dish and top each breast with about 1\/3 cup of tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle 1 to 2 tablespoons of Parmesan cheese on top and drizzle with 1 tablespoon olive oil. Bake in the preheated oven until cheese is browned and bubbly, and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "creatorId":-1
    },
    {
        "id":5,
        "name":"Creamy Au Gratin Potatoes",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Butter a medium casserole dish. Layer 1\/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste. In a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil. Bake 1 1\/2 hours in the preheated oven.",
        "creatorId":-1
    },
    {
        "id":6,
        "name":"Ground Beef and Cabbage",
        "instructions":"Combine cabbage, tomatoes with juice, onion, Italian seasoning, salt, and black pepper in a large pot over low  heat. Bring cabbage mixture to a simmer and crumble ground beef into the pot. Cover and cook until cabbage is tender and ground beef is cooked through, about 45 minutes. Stir occasionally.",
        "creatorId":-1
    },
    {
        "id":7,
        "name":"Juicy Roasted Chicken",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Place chicken in a roasting pan, and season generously inside and out with salt and pepper. Sprinkle inside and out with onion powder. Place 3 tablespoons margarine in the chicken cavity. Arrange dollops of the remaining margarine around the chicken's exterior. Cut the celery into 3 or 4 pieces, and place in the chicken cavity. Bake uncovered 1 hour and 15 minutes in the preheated oven, to a minimum internal temperature of 180 degrees F (82 degrees C). Remove from heat, and baste with melted margarine and drippings. Cover with aluminum foil, and allow to rest about 30 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":8,
        "name":"Okinawan-Style Pad Thai",
        "instructions":"Whisk together rice wine vinegar, 1\/2 cup sugar, oyster sauce, and tamarind pulp in a saucepan over medium heat until sugar dissolves, about 5 minutes; remove from heat and set aside. Place rice noodles in a large bowl and pour enough cold water to cover noodles. Allow to soften, about 10 minutes. Drain. Heat peanut oil in a wok or large skillet over medium heat. Cook and stir eggs and garlic in hot oil until eggs are softly cooked, 2 to 3 minutes. Stir chicken and noodles into eggs and cook until chicken is no longer pink in the center and juices run clear, about 5 minutes. Pour rice wine vinegar sauce, 1 1\/2 tablespoons sugar, and 1 1\/2 teaspoons salt into the noodle mixture. Stir peanuts, ground radish, and chili powder into noodle mixture; cook until peanuts soften slightly, about 5 minutes. Add more sugar or chili powder if desired. Remove from heat and toss chives with noodle mixture. Top with bean sprouts and garnish with lime wedges.",
        "creatorId":-1
    },
    {
        "id":9,
        "name":"Classic Macaroni Salad",
        "instructions":"Bring a large pot of lightly salted water to a boil. Add the macaroni, and cook until tender, about 8 minutes. Rinse under cold water and drain. In a large bowl, mix together the mayonnaise, vinegar, sugar, mustard, salt and pepper. Stir in the onion, celery, green pepper, carrot, pimentos and macaroni. Refrigerate for at least 4 hours before serving, but preferably overnight.",
        "creatorId":-1
    },
    {
        "id":10,
        "name":"Best Lemonade Ever",
        "instructions":"In a small saucepan, combine sugar and 1 cup water.  Bring to boil and stir to dissolve sugar. Allow to cool to room temperature, then cover and refrigerate until chilled. Remove seeds from lemon juice, but leave pulp. In pitcher, stir together chilled syrup, lemon juice and remaining 7 cups water.",
        "creatorId":-1
    },
    {
        "id":11,
        "name":"Tortellini Pesto Salad",
        "instructions":"Bring a large pot of lightly salted water to a boil. Place tortellini in the pot, and cook for 7 to 8 minutes, until al dente. Drain, and cool. In a large bowl, mix the cooked tortellini, red bell pepper, broccoli, carrots, olives, and garlic. In a separate bowl, stir together the mayonnaise, pesto, milk, Parmesan cheese, olive oil, and vinegar. Pour over the tortellini and vegetables, and gently toss to coat. Cover, and place in the refrigerator 1 hour, until chilled. Serve over spinach leaves.",
        "creatorId":-1
    },
    {
        "id":12,
        "name":"Tres Leches (Milk Cake)",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch baking pan. Sift flour and baking powder together and set aside. Cream butter or margarine and the 1 cup sugar together until fluffy. Add eggs and the 1\/2 teaspoon vanilla extract; beat well. Add the flour mixture to the butter mixture 2 tablespoons at a time; mix until well blended. Pour batter into prepared pan. Bake at 350 degrees F (175 degrees C) for 30 minutes. Pierce cake several times with a fork. Combine the whole milk, condensed milk, and evaporated milk together. Pour over the top of the cooled cake. Whip whipping cream, the remaining 1 cup of the sugar, and the remaining 1 teaspoon vanilla together until thick. Spread over the top of cake. Be sure and keep cake refrigerated, enjoy!",
        "creatorId":-1
    },
    {
        "id":13,
        "name":"Whipped Cream",
        "instructions":"In a large bowl, whip cream until stiff peaks are just about to form. Beat in vanilla and sugar until peaks form. Make sure not to over-beat, cream will then become lumpy and butter-like.",
        "creatorId":-1
    },
    {
        "id":14,
        "name":"Buffalo Chicken Wing Sauce",
        "instructions":"Combine the hot sauce, butter, vinegar, Worcestershire sauce, cayenne pepper, garlic powder, and salt in a pot and place over medium heat. Bring to a simmer while stirring with a whisk. As soon as the liquid begins to bubble on the sides of the pot, remove from heat, stir with the whisk, and set aside for use.",
        "creatorId":-1
    },
    {
        "id":15,
        "name":"Fajita Seasoning",
        "instructions":"Stir cornstarch, chili powder, salt, paprika, sugar, onion powder, garlic powder, cayenne pepper, and cumin together in a small bowl.",
        "creatorId":-1
    },
    {
        "id":16,
        "name":"Buttery Garlic Green Beans",
        "instructions":"Place green beans into a large skillet and cover with water; bring to a boil. Reduce heat to medium-low and simmer until beans start to soften, about 5 minutes. Drain water. Add butter to green beans; cook and stir until butter is melted, 2 to 3 minutes. Cook and stir garlic with green beans until garlic is tender and fragrant, 3 to 4 minutes. Season with lemon pepper and salt.",
        "creatorId":-1
    },
    {
        "id":17,
        "name":"Best Big, Fat, Chewy Chocolate Chip Cookie",
        "instructions":"Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper. Sift together the flour, baking soda and salt; set aside. In a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1\/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart. Bake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely.",
        "creatorId":-1
    },
    {
        "id":18,
        "name":"Abuela's Picadillo",
        "instructions":"Cook and stir ground beef in a large stockpot until browned, 5 to 10 minutes. Drain grease. Heat olive oil in small skillet over medium heat. Add onion, green bell pepper, and garlic; cook and stir until fragrant, 2 to 3 minutes. Stir into beef in the stockpot. Pour tomato sauce, water, cooking wine, and hot sauce into the stockpot. Stir in sazon seasoning, parsley, garlic powder, onion powder, cumin, pepper, and bay leaf. Bring to a boil; reduce heat to low and simmer picadillo, uncovered, until slightly thickened, about 10 minutes. Split olives in half with your fingers and stir into the picadillo. Add squash. Simmer until liquid reduces but picadillo is not dry, 45 to 60 minutes. Season with salt.",
        "creatorId":-1
    },
    {
        "id":19,
        "name":"Buffalo Chicken Dip",
        "instructions":"Heat chicken and hot sauce in a skillet over medium heat, until heated through. Stir in cream cheese and ranch dressing. Cook, stirring until well blended and warm. Mix in half of the shredded cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over the top, cover, and cook on Low setting until hot and bubbly. Serve with celery sticks and crackers.",
        "creatorId":-1
    },
    {
        "id":20,
        "name":"Baked Kale Chips",
        "instructions":"Preheat an oven to 350 degrees F (175 degrees C). Line a non insulated cookie sheet with parchment paper. With a knife or kitchen shears carefully remove the leaves from the thick stems and tear into bite size pieces. Wash and thoroughly dry kale with a salad spinner. Drizzle kale with olive oil and sprinkle with seasoning salt. Bake until the edges brown but are not burnt, 10 to 15 minutes.",
        "creatorId":-1
    },
    {
        "id":21,
        "name":"Vietnamese Fresh Spring Rolls",
        "instructions":"Bring a medium saucepan of water to boil. Boil rice vermicelli 3 to 5 minutes, or until al dente, and drain. Fill a large bowl with warm water. Dip one wrapper into the hot water for 1 second to soften. Lay wrapper flat. In a row across the center, place 2 shrimp halves, a handful of vermicelli, basil, mint, cilantro and lettuce, leaving about 2 inches uncovered on each side. Fold uncovered sides inward, then tightly roll the wrapper, beginning at the end with the lettuce. Repeat with remaining ingredients. In a small bowl, mix the fish sauce, water, lime juice, garlic, sugar and chili sauce. In another small bowl, mix the hoisin sauce and peanuts. Serve rolled spring rolls with the fish sauce and hoisin sauce mixtures.",
        "creatorId":-1
    },
    {
        "id":22,
        "name":"Quick and Easy Brownies",
        "instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch pan. Combine the melted butter, sugar, cocoa powder, vanilla, eggs, flour, baking powder, and salt. Spread the batter into the prepared pan. Decorate with walnut halves, if desired. Bake in preheated oven for 20 to 30 minutes or until a toothpick inserted in the center comes out with crumbs, not wet. Cool on wire rack.",
        "creatorId":-1
    },
    {
        "id":23,
        "name":"Quick Tartar Sauce",
        "instructions":"Stir the mayonnaise, relish, mustard, and lemon juice together in a bowl.",
        "creatorId":-1
    },
    {
        "id":24,
        "name":"Spaghetti Sauce with Ground Beef",
        "instructions":"Combine ground beef, onion, garlic, and green pepper in a large saucepan.  Cook and stir until meat is brown and vegetables are tender. Drain grease. Stir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally.",
        "creatorId":-1
    },
    {
        "id":25,
        "name":"Chicken Cordon Bleu I",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C).  Coat a 7x11 inch baking dish with nonstick cooking spray. Pound chicken breasts to 1\/4 inch thickness. Sprinkle each piece of chicken on both sides with salt and pepper.  Place 1 cheese slice and 1 ham slice on top of each breast. Roll up each breast, and secure with a toothpick.  Place in baking dish, and sprinkle chicken evenly with bread crumbs. Bake for 30 to 35 minutes, or until chicken is no longer pink. Remove from oven, and place 1\/2 cheese slice on top of each breast.  Return to oven for 3 to 5 minutes, or until cheese has melted. Remove toothpicks, and serve immediately.",
        "creatorId":-1
    },
    {
        "id":26,
        "name":"Grilled Salmon I",
        "instructions":"Season salmon fillets with lemon pepper, garlic powder, and salt. In a small bowl, stir together soy sauce, brown sugar, water, and vegetable oil until sugar is dissolved. Place fish in a large resealable plastic bag with the soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours. Preheat grill for medium heat. Lightly oil grill grate. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork.",
        "creatorId":-1
    },
    {
        "id":27,
        "name":"Tender Italian Baked Chicken",
        "instructions":"Preheat oven to 425 degrees F (220 degrees C). In a bowl, mix the mayonnaise, Parmesan cheese, and garlic powder. Place bread crumbs in a separate bowl. Dip chicken into the mayonnaise mixture, then into the bread crumbs to coat. Arrange coated chicken on a baking sheet. Bake 20 minutes in the preheated oven, or until chicken juices run clear and coating is golden brown.",
        "creatorId":-1
    },
    {
        "id":28,
        "name":"Roasted Brussels Sprouts",
        "instructions":"Preheat oven to 400 degrees F (205 degrees C). Place trimmed Brussels sprouts, olive oil, kosher salt, and pepper in a large resealable plastic bag. Seal tightly, and shake to coat. Pour onto a baking sheet, and place on center oven rack. Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately.",
        "creatorId":-1
    },
    {
        "id":29,
        "name":"Indian Chicken Curry (Murgh Kari)",
        "instructions":"Sprinkle the chicken breasts with 2 teaspoons salt. Heat the oil in a large skillet over high heat; partially cook the chicken in the hot oil in batches until completely browned. Transfer the browned chicken breasts to a plate and set aside. Reduce the heat under the skillet to medium-high; add the onion, garlic, and ginger to the oil remaining in the skillet and cook and stir until the onion turns translucent, about 8 minutes. Stir the curry powder, cumin, turmeric, coriander, cayenne, and 1 tablespoon of water into the onion mixture; allow to heat together for about 1 minute while stirring. Mix the tomatoes, yogurt, 1 tablespoon chopped cilantro, and 1 teaspoon salt into the mixture. Return the chicken breast to the skillet along with any juices on the plate. Pour 1\/2 cup water into the mixture; bring to a boil, turning the chicken to coat with the sauce. Sprinkle the garam masala and 1 tablespoon cilantro over the chicken. Cover the skillet and simmer until the chicken breasts are no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).  Sprinkle with lemon juice to serve.",
        "creatorId":-1
    },
    {
        "id":30,
        "name":"Baked Oatmeal II",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). In a large bowl, mix together oats, brown sugar, cinnamon, baking powder, and salt. Beat in milk, eggs, melted butter, and vanilla extract. Stir in dried cranberries. Spread into a 9x13 inch baking dish. Bake in preheated oven for 40 minutes.",
        "creatorId":-1
    },
    {
        "id":31,
        "name":"Slow Cooker Collard Greens",
        "instructions":"Fill a large pot about 1\/2 full with water. Place the ham shanks into the water, and as many of the greens as you can fit. Bring to a gentle boil. As soon as the greens begin wilting, start transferring the greens to the slow cooker. Alternate layers of greens with the ham shanks and jalapeno until the slow cooker is full. Stir in the baking soda, olive oil, pepper and garlic powder. Cover, and bring to a boil on High. Reduce heat to Low, and cook for 8 to 10 hours.",
        "creatorId":-1
    },
    {
        "id":32,
        "name":"Old Fashioned Potato Salad",
        "instructions":"Bring a large pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool, peel and chop. Place eggs in a saucepan and cover with cold water. Bring water to a boil; cover, remove from heat, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop. In a large bowl, combine the potatoes, eggs, celery, onion, relish, garlic salt, celery salt, mustard, pepper and mayonnaise. Mix together well and refrigerate until chilled.",
        "creatorId":-1
    },
    {
        "id":33,
        "name":"Spaghetti Aglio e Olio",
        "instructions":"Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain and transfer to a pasta bowl. Combine garlic and olive oil in a cold skillet. Cook over medium heat to slowly toast garlic, about 10 minutes. Reduce heat to medium-low when olive oil begins to bubble. Cook and stir until garlic is golden brown, about another 5 minutes. Remove from heat. Stir red pepper flakes, black pepper, and salt into the pasta. Pour in olive oil and garlic, and sprinkle on Italian parsley and half of the Parmigiano-Reggiano cheese; stir until combined. Serve pasta topped with the remaining Parmigiano-Reggiano cheese.",
        "creatorId":-1
    },
    {
        "id":34,
        "name":"Simple Syrup",
        "instructions":"In a medium saucepan combine sugar and water. Bring to a boil, stirring, until sugar has dissolved. Allow to cool.",
        "creatorId":-1
    },
    {
        "id":35,
        "name":"Roasted Vegetables",
        "instructions":"Preheat oven to 475 degrees F (245 degrees C). In a large bowl, combine the squash, red bell peppers, sweet potato, and Yukon Gold potatoes. Separate the red onion quarters into pieces, and add them to the mixture. In a small bowl, stir together thyme, rosemary, olive oil, vinegar, salt, and pepper. Toss with vegetables until they are coated. Spread evenly on a large roasting pan. Roast for 35 to 40 minutes in the preheated oven, stirring every 10 minutes, or until vegetables are cooked through and browned.",
        "creatorId":-1
    },
    {
        "id":36,
        "name":"Balsamic Bruschetta",
        "instructions":"In a bowl, toss together the tomatoes, basil, Parmesan cheese, and garlic. Mix in the balsamic vinegar, olive oil, kosher salt, and pepper. Serve on toasted bread slices.",
        "creatorId":-1
    },
    {
        "id":37,
        "name":"Mexican Rice II",
        "instructions":"Heat oil in a large saucepan over medium heat and add rice.  Cook, stirring constantly, until puffed and golden.  While rice is cooking, sprinkle with salt and cumin. Stir in onions and cook until tender.  Stir in tomato sauce and chicken broth; bring to a boil.  Reduce heat to low, cover and simmer for 20 to 25 minutes.  Fluff with a fork.",
        "creatorId":-1
    },
    {
        "id":38,
        "name":"Chef John's Italian Meatballs",
        "instructions":"Cover a baking sheet with foil and spray lightly with cooking spray. Soak bread crumbs in milk in a small bowl for 20 minutes. Heat olive oil in a skillet over medium heat. Cook and stir onions in hot oil until translucent, about 20 minutes. Mix beef and pork together in a large bowl. Stir onions, bread crumb mixture, eggs, parsley, garlic, salt, black pepper, red pepper flakes, Italian herb seasoning, and Parmesan cheese into meat mixture with a rubber spatula until combined. Cover and refrigerate for about one hour. Preheat an oven to 425 degrees F (220 degrees C). Using wet hands, form meat mixture into balls about 1 1\/2 inches in diameter. Arrange onto prepared baking sheet. Bake in the preheated oven until browned and cooked through, 15 to 20 minutes.",
        "creatorId":-1
    },
    {
        "id":39,
        "name":"Pan-Fried Asparagus",
        "instructions":"Melt butter in a skillet over medium-high heat. Stir in the olive oil, salt, and pepper. Cook garlic in butter for a minute, but do not brown. Add asparagus, and cook for 10 minutes, turning asparagus to ensure even cooking.",
        "creatorId":-1
    },
    {
        "id":40,
        "name":"Old Fashioned Onion Rings",
        "instructions":"Heat the oil in a deep-fryer to 365 degrees F (185 degrees C). Separate the onion slices into rings, and set aside. In a small bowl, stir together the flour, baking powder and salt. Dip the onion slices into the flour mixture until they are all coated; set aside. Whisk the egg and milk into the flour mixture using a fork. Dip the floured rings into the batter to coat, then place on a wire rack to drain until the batter stops dripping. The wire rack may be placed over a sheet of aluminum foil for easier clean up. Spread the bread crumbs out on a plate or shallow dish. Place rings one at a time into the crumbs, and scoop the crumbs up over the ring to coat. Give it a hard tap as you remove it from the crumbs. The coating should cling very well. Repeat with remaining rings. Deep fry the rings a few at a time for 2 to 3 minutes, or until golden brown. Remove to paper towels to drain. Season with seasoning salt, and serve.",
        "creatorId":-1
    },
    {
        "id":41,
        "name":"Pasta Salad",
        "instructions":"In a large pot of salted boiling water, cook pasta until al dente, rinse under cold water and drain. Whisk together the salad spice mix and Italian dressing. In a salad bowl, combine the pasta, cherry tomatoes, bell peppers and olives. Pour dressing over salad; toss and refrigerate overnight.",
        "creatorId":-1
    },
    {
        "id":42,
        "name":"Super-Delicious Zuppa Toscana",
        "instructions":"Cook the Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until crumbly, browned, and no longer pink, 10 to 15 minutes. Drain and set aside. Cook the bacon in the same Dutch oven over medium heat until crisp, about 10 minutes. Drain, leaving a few tablespoons of drippings with the bacon in the bottom of the Dutch oven. Stir in the onions and garlic; cook until onions are soft and translucent, about 5 minutes. Pour the chicken broth into the Dutch oven with the bacon and onion mixture; bring to a boil over high heat. Add the potatoes, and boil until fork tender, about 20 minutes. Reduce the heat to medium and stir in the heavy cream and the cooked sausage; heat through. Mix the spinach into the soup just before serving.",
        "creatorId":-1
    },
    {
        "id":43,
        "name":"Pico De Gallo",
        "instructions":"Stir the tomatoes, onion, cilantro, jalapeno pepper, lime juice, garlic, garlic powder, cumin, salt, and pepper together in a bowl. Refrigerate at least 3 hours before serving.",
        "creatorId":-1
    },
    {
        "id":44,
        "name":"Spanish Flan",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). In a medium saucepan over medium-low heat, melt sugar until liquefied and golden in color.  Carefully pour hot syrup into a 9 inch round glass baking dish, turning the dish to evenly coat the bottom and sides.  Set aside. In a large bowl, beat eggs.  Beat in condensed milk, evaporated milk and vanilla until smooth.  Pour egg mixture into baking dish.  Cover with aluminum foil. Bake in preheated oven 60 minutes.  Let cool completely. To serve, carefully invert on serving plate with edges when completely cool.",
        "creatorId":-1
    },
    {
        "id":45,
        "name":"Grilled Asparagus",
        "instructions":"Preheat grill for high heat. Lightly coat the asparagus spears with olive oil. Season with salt and pepper to taste. Grill over high heat for 2 to 3 minutes, or to desired tenderness.",
        "creatorId":-1
    },
    {
        "id":46,
        "name":"Easy Garam Masala",
        "instructions":"Mix cumin, coriander, cardamom, pepper, cinnamon, cloves, and nutmeg in a bowl. Place mix in an airtight container, and store in a cool, dry place.",
        "creatorId":-1
    },
    {
        "id":47,
        "name":"Vanilla Ice Cream",
        "instructions":"Stir sugar, cream, and milk into a saucepan over low heat until sugar has dissolved. Heat just until mix is hot and a small ring of foam appears around the edge. Transfer cream mixture to a pourable container such as a large measuring cup. Stir in vanilla extract and chill mix thoroughly, at least 2 hours. (Overnight is best.) Pour cold ice cream mix into an ice cream maker, turn on the machine, and churn according to manufacturer's directions, 20 to 25 minutes. When ice cream is softly frozen, serve immediately or place a piece of plastic wrap directly on the ice cream and place in freezer to ripen, 2 to 3 hours.",
        "creatorId":-1
    },
    {
        "id":48,
        "name":"Perfect Sushi Rice",
        "instructions":"Rinse the rice in a strainer or colander until the water runs clear. Combine with water in a medium saucepan. Bring to a boil, then reduce the heat to low, cover and cook for 20 minutes. Rice should be tender and water should be absorbed. Cool until cool enough to handle. In a small saucepan, combine the rice vinegar, oil, sugar and salt. Cook over medium heat until the sugar dissolves. Cool, then stir into the cooked rice. When you pour this in to the rice it will seem very wet. Keep stirring and the rice will dry as it cools.",
        "creatorId":-1
    },
    {
        "id":49,
        "name":"Italian Bread Salad with Strawberries and Tomatoes",
        "instructions":"Preheat the oven to 375 degrees F (190 degrees C). Toss bread cubes with 2 tablespoons olive oil, garlic powder, onion powder, salt, and black pepper on a large baking sheet until evenly coated; spread mixture into a single layer. Bake in preheated oven until toasted, about 10 minutes. Transfer toasted bread to a large bowl and mix with strawberries, tomatoes, feta cheese, and onion. Whisk 1\/4 cup olive oil, red wine vinegar, and honey in a small bowl; drizzle over bread and tomato salad. Toss to coat.",
        "creatorId":-1
    },
    {
        "id":50,
        "name":"Homemade Flour Tortillas",
        "instructions":"Whisk the flour, salt, and baking powder together in a mixing bowl. Mix in the lard with your fingers until the flour resembles cornmeal. Add the water and mix until the dough comes together; place on a lightly floured surface and knead a few minutes until smooth and elastic. Divide the dough into 24 equal pieces and roll each piece into a ball. Preheat a large skillet over medium-high heat. Use a well-floured rolling pin to roll a dough ball into a thin, round tortilla. Place into the hot skillet, and cook until bubbly and golden; flip and continue cooking until golden on the other side. Place the cooked tortilla in a tortilla warmer; continue rolling and cooking the remaining dough.",
        "creatorId":-1
    },
    {
        "id":51,
        "name":"Mamaw's Chicken and Rice Casserole",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Grease sides and bottom of a casserole dish. Stir chicken, water, rice, cream of chicken soup, cream of celery soup, and cream of mushroom soup together in the prepared casserole dish; season with salt and pepper. Arrange butter evenly over the top of the chicken mixture. Bake in preheated oven until the rice is tender and the chicken is cooked through, 1 hour to 75 minutes. Cool 15 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":52,
        "name":"Chicken and Asparagus Fettuccine",
        "instructions":"Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until al dente. Add the asparagus during the last 3 to 5 minutes of cooking. Drain, and transfer to a large bowl. In a large saucepan over medium heat, combine butter and half-and-half. Cook until thick and bubbly. Season with garlic powder, black pepper, and cayenne pepper. Stir in Parmesan cheese and chicken, and heat through. Pour sauce over pasta and asparagus, and toss to coat.",
        "creatorId":-1
    },
    {
        "id":53,
        "name":"Spicy Thai Basil Chicken (Pad Krapow Gai)",
        "instructions":"Whisk chicken broth, oyster sauce, soy sauce, fish sauce, white sugar, and brown sugar together in a bowl until well blended. Heat large skillet over high heat. Drizzle in oil. Add chicken and stir fry until it loses its raw color, 2 to 3 minutes. Stir in shallots, garlic, and sliced chilies. Continue cooking on high heat until some of the juices start to caramelize in the bottom of the pan, about 2 or 3 more minutes. Add about a tablespoon of the sauce mixture to the skillet; cook and stir until sauce begins to caramelize, about 1 minute. Pour in the rest of the sauce. Cook and stir until sauce has deglazed the bottom of the pan. Continue to cook until sauce glazes onto the meat, 1 or 2 more minutes. Remove from heat. Stir in basil. Cook and stir until basil is wilted, about 20 seconds. Serve with rice.",
        "creatorId":-1
    },
    {
        "id":54,
        "name":"Southern Pimento Cheese",
        "instructions":"Place the Cheddar cheese, cream cheese, mayonnaise, garlic powder, cayenne pepper, onion powder, minced jalapeno, and pimento into the large bowl of a mixer. Beat at medium speed, with paddle if possible, until thoroughly combined. Season to taste with salt and black pepper.",
        "creatorId":-1
    },
    {
        "id":55,
        "name":"Delicious Chana Masala",
        "instructions":"Heat oil in a large saucepan over medium heat. Saute onion, garlic, ginger, and green chile pepper in hot oil until onions are translucent, about 10 minutes. Season onion mixture with cumin, paprika, coriander, garam masala, turmeric, and cayenne pepper; stir. Cook onion with spices until fragrant, 1 to 2 minutes. Add tomatoes, chickpeas, and tomato sauce; stir and simmer until the tomatoes soften, about 5 minutes. Stir yogurt into the mixture until the color of the mixture is even; simmer until again hot, about 5 minutes more. Remove pan from heat; stir lemon juice and salt into the mixture.",
        "creatorId":-1
    },
    {
        "id":56,
        "name":"Pesto Pasta",
        "instructions":"Cook pasta in a large pot of boiling water until done.  Drain. Meanwhile, heat the oil in a frying pan over medium low heat.   Add pesto, onion, and salt and pepper.  Cook about five minutes, or until onions are soft. In a large bowl, mix pesto mixture into pasta.  Stir in grated cheese.  Serve.",
        "creatorId":-1
    },
    {
        "id":57,
        "name":"Mouth-Watering Stuffed Mushrooms",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray. Clean mushrooms with a damp paper towel.  Carefully break off stems.  Chop stems extremely fine, discarding tough end of stems. Heat oil in a large skillet over medium heat. Add garlic and chopped mushroom stems to the skillet. Fry until any moisture has disappeared, taking care not to burn garlic.  Set aside to cool. When garlic and mushroom mixture is no longer hot, stir in cream cheese, Parmesan cheese, black pepper, onion powder and cayenne pepper.  Mixture should be very thick. Using a little spoon, fill each mushroom cap with a generous amount of stuffing. Arrange the mushroom caps on prepared cookie sheet. Bake for 20 minutes in the preheated oven, or until the mushrooms are piping hot and liquid starts to form under caps.",
        "creatorId":-1
    },
    {
        "id":58,
        "name":"Perfect Polenta",
        "instructions":"Bring water and salt to a boil in a large saucepan; pour polenta slowly into boiling water, whisking constantly until all polenta is stirred in and there are no lumps. Reduce heat to low and simmer, whisking often, until polenta starts to thicken, about 5 minutes. Polenta mixture should still be slightly loose. Cover and cook for 30 minutes, whisking every 5 to 6 minutes. When polenta is too thick to whisk, stir with a wooden spoon. Polenta is done when texture is creamy and the individual grains are tender. Turn off heat and gently stir 2 tablespoons butter into polenta until butter partially melts; mix  1\/2 cup Parmigiano-Reggiano cheese into polenta until cheese has melted. Cover and let stand 5 minutes to thicken; stir and taste for salt before transferring to a serving bowl. Top polenta with remaining 1 tablespoon butter and about 1 tablespoon freshly grated Parmigiano-Reggiano cheese for garnish.",
        "creatorId":-1
    },
    {
        "id":59,
        "name":"Scones",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet. In a large bowl, combine flour, sugar, baking powder, and salt. Cut in butter. Mix the egg and milk in a small bowl, and stir into flour mixture until moistened. Turn dough out onto a lightly floured surface, and knead briefly. Roll dough out into a 1\/2 inch thick round. Cut into 8 wedges, and place on the prepared baking sheet. Bake 15 minutes in the preheated oven, or until golden brown.",
        "creatorId":-1
    },
    {
        "id":60,
        "name":"Garlic Aioli",
        "instructions":"Mix mayonnaise, garlic, lemon juice, salt, and pepper in a bowl. Cover and refrigerate for at least 30 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":61,
        "name":"Cheesy Amish Breakfast Casserole",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. Heat a large skillet over medium-high heat; cook and stir bacon and onion until bacon is evenly browned, about 10 minutes. Drain. Transfer bacon and onion to a large bowl. Stir in potatoes, eggs, Cheddar cheese, cottage cheese, and Swiss cheese. Pour mixture into prepared baking dish. Bake in preheated oven until eggs are set and cheese is melted, 45 to 50 minutes. Let stand 10 minutes before cutting and serving.",
        "creatorId":-1
    },
    {
        "id":62,
        "name":"Rich and Simple French Onion Soup",
        "instructions":"Melt butter with olive oil in an 8 quart stock pot on medium heat. Add onions and continually stir until tender and translucent. Do not brown the onions. Add beef broth, sherry and thyme. Season with salt and pepper, and simmer for 30 minutes. Heat the oven broiler. Ladle soup into oven safe serving bowls and place one slice of bread on top of each (bread may be broken into pieces if you prefer). Layer each slice of bread with a slice of provolone, 1\/2 slice diced Swiss and 1 tablespoon Parmesan cheese. Place bowls on cookie sheet and broil in the preheated oven until cheese bubbles and  browns slightly.",
        "creatorId":-1
    },
    {
        "id":63,
        "name":"Easy Guacamole",
        "instructions":"Peel and mash avocados in a medium serving bowl. Stir in onion, garlic, tomato, lime juice, salt and pepper.  Season with remaining lime juice and salt and pepper to taste. Chill for half an hour to blend flavors.",
        "creatorId":-1
    },
    {
        "id":64,
        "name":"Shrimp Scampi with Pasta",
        "instructions":"Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain. Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm. Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve.",
        "creatorId":-1
    },
    {
        "id":65,
        "name":"Strawberry Jam",
        "instructions":"In a wide bowl, crush strawberries in batches until you have 4 cups of mashed berry. In a heavy bottomed saucepan, mix together the strawberries, sugar, and lemon juice. Stir over low heat until the sugar is dissolved. Increase heat to high, and bring the mixture to a full rolling boil. Boil, stirring often, until the mixture reaches 220 degrees F (105 degrees C).  Transfer to hot sterile jars, leaving 1\/4 to 1\/2 inch headspace, and seal. Process in a water bath. If the jam is going to be eaten right away, don't bother with processing, and just refrigerate.",
        "creatorId":-1
    },
    {
        "id":66,
        "name":"Artichoke Chicken",
        "instructions":"Preheat oven to 375 degrees F (190 degrees C). In a medium bowl, mix together the artichoke hearts, Parmesan cheese, mayonnaise, and garlic pepper. Place chicken in a greased baking dish, and cover evenly with artichoke mixture. Bake, uncovered, for 30 minutes in the preheated oven, or until chicken is no longer pink in the center and juices run clear.",
        "creatorId":-1
    },
    {
        "id":67,
        "name":"Grilled Cheese Sandwich",
        "instructions":"Preheat skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side-down onto skillet bottom and add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side-up on top of sandwich. Grill until lightly browned and flip over; continue grilling until cheese is melted. Repeat with remaining 2 slices of bread, butter and slice of cheese.",
        "creatorId":-1
    },
    {
        "id":68,
        "name":"Roasted Rack of Lamb",
        "instructions":"Preheat oven to 450 degrees F (230 degrees C). Move oven rack to  the center position. In a large bowl, combine bread crumbs, garlic, rosemary, 1 teaspoon salt and 1\/4 teaspoon pepper. Toss in 2 tablespoons olive oil to moisten mixture. Set aside. Season the rack all over with salt and pepper. Heat 2 tablespoons olive oil in a large heavy oven proof skillet over high heat. Sear rack of lamb for 1 to 2 minutes on all sides. Set aside for a few minutes. Brush rack of lamb with the mustard. Roll in the bread crumb mixture until evenly coated. Cover the ends of the bones with foil to prevent charring. Arrange the rack bone side down in the skillet. Roast the lamb in preheated oven for 12 to 18 minutes, depending on the degree of doneness you want. With a meat thermometer, take a reading in the center of the meat after 10 to 12 minutes and remove the meat, or let it cook longer, to your taste. Let it rest for 5 to 7 minutes, loosely covered, before carving between the ribs.",
        "creatorId":-1
    },
    {
        "id":69,
        "name":"The Best Steak Marinade",
        "instructions":"Mix olive oil, balsamic vinegar, Worcestershire sauce, soy sauce, Dijon mustard, and garlic in a small bowl. Season with salt and pepper.",
        "creatorId":-1
    },
    {
        "id":70,
        "name":"Special Beef Rendang Curry",
        "instructions":"This first step is to soften the beef. Place the beef in a medium saucepan, and add enough water to cover the meat.  Cover, and simmer over low heat for at least an hour. Remove the beef from water, and set aside. Heat the oil in a wok over medium-high heat. Add in the garlic and dried shrimp, and stir fry for a few seconds before stirring in the lemongrass and onions. Reduce heat to medium, and stir in coconut milk, red curry paste, turmeric, and chile pepper. Mix in the beef, and cover the wok. Simmer for 10 minutes over medium heat. Stir in the cilantro just before serving. Save some cilantro for garnishing on top if you like.",
        "creatorId":-1
    },
    {
        "id":71,
        "name":"Good New Orleans Creole Gumbo",
        "instructions":"Make a roux by whisking the flour and 3\/4 cup bacon drippings together in a large, heavy saucepan over medium-low heat to form a smooth mixture. Cook the roux, whisking constantly, until it turns a rich mahogany brown color. This can take 20 to 30 minutes; watch heat carefully and whisk constantly or roux will burn. Remove from heat; continue whisking until mixture stops cooking. Place the celery, onion, green bell pepper, and garlic into the work bowl of a food processor, and pulse until the vegetables are very finely chopped. Stir the vegetables into the roux, and mix in the sausage. Bring the mixture to a simmer over medium-low heat, and cook until vegetables are tender, 10 to 15 minutes. Remove from heat, and set aside. Bring the water and beef bouillon cubes to a boil in a large Dutch oven or soup pot. Stir until the bouillon cubes dissolve, and whisk the roux mixture into the boiling water. Reduce heat to a simmer, and mix in the sugar, salt, hot pepper sauce, Cajun seasoning, bay leaves, thyme, stewed tomatoes, and tomato sauce. Simmer the soup over low heat for 1 hour; mix in 2 teaspoons of file gumbo powder at the 45-minute mark. Meanwhile, melt 2 tablespoons of bacon drippings in a skillet, and cook the okra with vinegar over medium heat for 15 minutes; remove okra with slotted spoon, and stir into the simmering gumbo. Mix in crabmeat, shrimp, and Worcestershire sauce, and simmer until flavors have blended, 45 more minutes. Just before serving, stir in 2 more teaspoons of file gumbo powder.",
        "creatorId":-1
    },
    {
        "id":72,
        "name":"Fresh Broccoli Salad",
        "instructions":"Place bacon in a deep skillet and cook over medium high heat until evenly brown. Cool and crumble. Cut the broccoli into bite-size pieces and cut the onion into thin bite-size slices. Combine with the bacon, raisins,  your favorite nuts and mix well. To prepare the dressing, mix the mayonnaise, sugar and vinegar together until smooth. Stir into the salad, let chill and serve.",
        "creatorId":-1
    },
    {
        "id":73,
        "name":"Easy Mexican Casserole",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). In a large skillet over medium-high heat, cook ground beef until no longer pink. Stir in salsa, reduce heat, and simmer 20 minutes, or until liquid is absorbed. Stir in beans, and heat through. Spray a 9x13 baking dish with cooking spray. Spread crushed tortilla chips in dish, and then spoon beef mixture over chips. Spread sour cream over beef, and sprinkle olives, green onion, and tomato over the sour cream. Top with Cheddar cheese. Bake in preheated oven for 30 minutes, or until hot and bubbly.",
        "creatorId":-1
    },
    {
        "id":74,
        "name":"Chicken Katsu",
        "instructions":"Season the chicken breasts on both sides with salt and pepper. Place the flour, egg and panko crumbs into separate shallow dishes. Coat the chicken breasts in flour, shaking off any excess. Dip them into the egg, and then press into the panko crumbs until well coated on both sides. Heat 1\/4 inch of oil in a large skillet over medium-high heat. Place chicken in the hot oil, and cook 3 or 4 minutes per side, or until golden brown.",
        "creatorId":-1
    },
    {
        "id":75,
        "name":"Miso Soup",
        "instructions":"In a medium saucepan over medium-high heat, combine dashi granules and water; bring to a boil. Reduce heat to medium, and whisk in the miso paste. Stir in tofu. Separate the layers of the green onions, and add them to the soup. Simmer gently for 2 to 3 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":76,
        "name":"Prize Winning Baby Back Ribs",
        "instructions":"Preheat a gas grill for high heat, or arrange charcoal briquettes on one side of the barbeque. Lightly oil the grate. In a small jar, combine cumin, chili powder, paprika, salt, and pepper. Close the lid, and shake to mix. Trim the membrane sheath from the back of each rack. Run a small, sharp knife between the membrane and each rib, and snip off the membrane as much as possible. Sprinkle as much of the rub onto both sides of the ribs as desired. To prevent the ribs from becoming too dark and spicy, do not thoroughly rub the spices into the ribs. Store the unused portion of the spice mix for future use. Place aluminum foil on lower rack to capture drippings and prevent flare-ups. Lay the ribs on the top rack of the grill (away from the coals, if you're using briquettes). Reduce gas heat to low, close lid, and leave undisturbed for 1 hour. Do not lift the lid at all. Brush ribs with barbecue sauce, and grill an additional 5 minutes. Serve ribs as whole rack, or cut between each rib bone and pile individually on a platter.",
        "creatorId":-1
    },
    {
        "id":77,
        "name":"Chicken Marsala",
        "instructions":"In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture. In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown.  Turn over chicken pieces, and add mushrooms. Pour in wine and sherry.  Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear.",
        "creatorId":-1
    },
    {
        "id":78,
        "name":"Kickin' Collard Greens",
        "instructions":"Heat oil in a large pot over medium-high heat. Add bacon, and cook until crisp. Remove bacon from pan, crumble and return to the pan.  Add onion, and cook until tender, about 5 minutes.  Add garlic, and cook until just fragrant. Add  , and fry until they start to wilt. Pour in chicken broth, and season with salt, pepper, and red pepper flakes. Reduce heat to low, cover, and simmer for 45 minutes, or until greens are tender.",
        "creatorId":-1
    },
    {
        "id":79,
        "name":"Asian Lettuce Wraps",
        "instructions":"Rinse whole lettuce leaves and pat dry, being careful not tear them. Set aside. Heat a large skillet over medium-high heat. Cook and stir beef and cooking oil in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease; transfer beef to a bowl. Cook and stir onion in the same skillet used for beef until slightly tender, 5 to 10 minutes. Stir hoisin sauce, garlic, soy sauce, vinegar, ginger, and chile pepper sauce into onions. Add water chestnuts, green onions, sesame oil, and cooked beef; cook and stir until the onions just begin to wilt, about 2 minutes. Arrange lettuce leaves around the outer edge of a large serving platter and pile meat mixture in the center.",
        "creatorId":-1
    },
    {
        "id":80,
        "name":"Authentic Louisiana Red Beans and Rice",
        "instructions":"Rinse beans, and then soak in a large pot of water overnight. In a skillet, heat oil over medium heat. Cook onion, bell pepper, garlic, and celery in olive oil for 3 to 4 minutes. Rinse beans, and transfer to a large pot with 6 cups water. Stir cooked vegetables into beans. Season with bay leaves, cayenne pepper, thyme, sage, parsley, and Cajun seasoning. Bring to a boil, and then reduce heat to medium-low. Simmer for 2 1\/2 hours. Stir sausage into beans, and continue to simmer for 30 minutes. Meanwhile, prepare the rice. In a saucepan, bring water and rice to a boil. Reduce heat, cover, and simmer for 20 minutes. Serve beans over steamed white rice.",
        "creatorId":-1
    },
    {
        "id":81,
        "name":"Better-Than-Olive Garden® Alfredo Sauce",
        "instructions":"Melt butter and olive oil in a saucepan over medium-low heat. Add cream, garlic, and white pepper; bring to just under a boil. Reduce heat and simmer, stirring often, until mixture is slightly reduced, about 5 minutes. Stir Parmesan cheese into cream mixture and simmer until sauce is thickened and smooth, 8 to 10 minutes. Add mozzarella cheese to sauce; cook and stir until cheese is melted, about 5 minutes. Bring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water, stirring occasionally until cooked through but firm to the bite, 3 to 5 minutes. Drain and transfer pasta to serving plates. Spoon sauce over pasta.",
        "creatorId":-1
    },
    {
        "id":82,
        "name":"Baked Paprika-Parmesan Chicken",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C).  Coat a shallow baking dish with nonstick cooking spray. Combine flour, parmesan, paprika, salt, and pepper in a bowl.  In a separate bowl, whisk together the egg and milk.  Dip the chicken in the egg, then dredge in the flour mixture.  Place in the baking dish, and pour the melted butter evenly over the chicken. Bake for about 1 hour and 15 minutes in the preheated oven, until the cheese has browned, and the chicken has cooked.",
        "creatorId":-1
    },
    {
        "id":83,
        "name":"Garlic Butter",
        "instructions":"In a small bowl, combine softened butter, minced garlic and parmesan cheese. Season with garlic salt, Italian seasoning, pepper and paprika. Mix until smooth.",
        "creatorId":-1
    },
    {
        "id":84,
        "name":"Unbelievable Fish Batter",
        "instructions":"Whisk together the flour, milk, water, baking powder, and salt in a bowl until smooth.",
        "creatorId":-1
    },
    {
        "id":85,
        "name":"Cajun Spice Mix",
        "instructions":"Stir together salt, garlic powder, paprika, black pepper, onion powder, cayenne pepper, oregano, thyme, and red pepper flakes until evenly blended. Store in an airtight container.",
        "creatorId":-1
    },
    {
        "id":86,
        "name":"Churros",
        "instructions":"In a small saucepan over medium heat, combine water, 2 1\/2 tablespoons sugar, salt and 2 tablespoons vegetable oil. Bring to a boil and remove from heat. Stir in flour until mixture forms a ball. Heat oil for frying in a deep fryer or deep pot to 375 degrees F (190 degrees C). Pipe 5- to 6-inch strips of dough into the hot oil using a sturdy pastry bag fitted with a medium star tip. Do not overcrowd the oil. Fry until golden; drain on paper towels. Combine 1\/2 cup sugar and cinnamon. Roll drained churros in cinnamon and sugar mixture.",
        "creatorId":-1
    },
    {
        "id":87,
        "name":"Reuben Sandwich II",
        "instructions":"Preheat a large skillet or griddle on medium heat. Lightly butter one side of bread slices. Spread non-buttered sides with Thousand Island dressing. On 4 bread slices, layer 1 slice Swiss cheese, 2 slices corned beef, 1\/4 cup sauerkraut and second slice of Swiss cheese. Top with remaining bread slices, buttered sides out. Grill sandwiches until both sides are golden brown, about 5 minutes per side. Serve hot.",
        "creatorId":-1
    },
    {
        "id":88,
        "name":"Corn Dogs",
        "instructions":"In a medium bowl, combine cornmeal, flour, salt, pepper, sugar and baking powder. Stir in eggs and milk. Preheat oil in a deep saucepan over medium heat. Insert wooden skewers into frankfurters. Roll frankfurters in batter until well coated. Fry 2 or 3 corn dogs at a time until lightly browned, about 3 minutes. Drain on paper towels.",
        "creatorId":-1
    },
    {
        "id":89,
        "name":"The Best Chicken Fried Steak",
        "instructions":"Pound the steaks to about 1\/4-inch thickness. Place 2 cups of  flour in a shallow bowl. Stir together the baking powder, baking soda, pepper, and salt in a separate shallow bowl; stir in the buttermilk, egg, Tabasco Sauce, and garlic. Dredge each steak first in the flour, then in the batter, and again in the flour. Pat the flour onto the surface of each steak so they are completely coated with dry flour. Heat the shortening in a deep cast-iron skillet to 325 degrees F (165 degrees C). Fry the steaks until evenly golden brown, 3 to 5 minutes per side. Place fried steaks on a plate with paper towels to drain. Drain the fat from the skillet, reserving 1\/4 cup of the liquid and as much of the solid remnants as possible. Return the skillet to medium-low heat with the reserved oil. Whisk the remaining flour into the oil. Scrape the bottom of the pan with a spatula to release solids into the gravy. Stir in the milk, raise the heat to medium, and bring the gravy to a simmer, cook until thick, 6 to 7 minutes. Season with kosher salt and pepper. Spoon the gravy over the steaks to serve.",
        "creatorId":-1
    },
    {
        "id":90,
        "name":"Awesome and Easy Creamy Corn Casserole",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C), and lightly grease a 9x9 inch baking dish. In a medium bowl, combine butter, eggs, corn bread mix, whole and creamed corn and sour cream. Spoon mixture into prepared dish. Bake for 45 minutes in the preheated oven, or until the top is golden brown.",
        "creatorId":-1
    },
    {
        "id":91,
        "name":"Easy Paella",
        "instructions":"In a medium bowl, mix together 2 tablespoons olive oil, paprika, oregano, and salt and pepper. Stir in chicken pieces to coat. Cover, and refrigerate. Heat 2 tablespoons olive oil in a large skillet or paella pan over medium heat. Stir in garlic, red pepper flakes, and rice. Cook, stirring, to coat rice with oil, about 3 minutes. Stir in saffron threads, bay leaf, parsley, chicken stock, and lemon zest. Bring to a boil, cover, and reduce heat to medium low. Simmer 20 minutes. Meanwhile, heat 2 tablespoons olive oil in a separate skillet over medium heat. Stir in marinated chicken and onion; cook 5 minutes. Stir in bell pepper and sausage; cook 5 minutes. Stir in shrimp; cook, turning the shrimp, until both sides are pink. Spread rice mixture onto a serving tray. Top with meat and seafood mixture.",
        "creatorId":-1
    },
    {
        "id":92,
        "name":"Manicotti",
        "instructions":"Cook manicotti in boiling water until done.  Drain, and rinse with cold water. Preheat oven to 350 degrees F (175 degrees C). In a large bowl, combine ricotta, mozzarella, and 1\/2 cup Parmesan, eggs, parsley, and salt and pepper.  Mix well. Pour 1\/2 cup sauce into an 11x17 inch baking dish.  Fill each manicotti shell with 3 tablespoons cheese mixture, and arrange over sauce . Pour remaining sauce over top, and sprinkle with remaining Parmesan cheese. Bake 45 minutes, or until bubbly.",
        "creatorId":-1
    },
    {
        "id":93,
        "name":"Stuffed Peppers",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Place the rice and water in a saucepan, and bring to a boil. Reduce heat, cover, and cook 20 minutes. In a skillet over medium heat, cook the beef until evenly browned. Remove and discard the tops, seeds, and membranes of the bell peppers. Arrange peppers in a baking dish with the hollowed sides facing upward. (Slice the bottoms of the peppers if necessary so that they will stand upright.) In a bowl, mix the browned beef, cooked rice, 1 can tomato sauce, Worcestershire sauce, garlic powder, onion powder, salt, and pepper. Spoon an equal amount of the mixture into each hollowed pepper. Mix the remaining tomato sauce and Italian seasoning in a bowl, and pour over the stuffed peppers. Bake 1 hour in the preheated oven, basting with sauce every 15 minutes, until the peppers are tender.",
        "creatorId":-1
    },
    {
        "id":94,
        "name":"The Best Thai Coconut Soup",
        "instructions":"Heat the oil in a large pot over medium heat. Cook and stir the ginger, lemongrass, and curry paste in the heated oil for 1 minute. Slowly pour the chicken broth over the mixture, stirring continually. Stir in the fish sauce and brown sugar; simmer for 15 minutes. Stir in the coconut milk and mushrooms; cook and stir until the mushrooms are soft, about 5 minutes. Add the shrimp; cook until no longer translucent about 5 minutes. Stir in the lime juice; season with salt; garnish with cilantro.",
        "creatorId":-1
    },
    {
        "id":95,
        "name":"Simple Baked Chicken Breasts",
        "instructions":"Preheat convection oven to 400 degrees F (200 degrees C). Rub chicken breasts with olive oil and sprinkle both sides with salt and Creole seasoning. Place chicken in a broiler pan. Bake in the preheated oven for 10 minutes. Flip chicken and cook until no longer pink in the center and the juices run clear, about 15 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from pan. Pour water into the pan, while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add more water if needed to dislodge the browned bits; serve alongside chicken.",
        "creatorId":-1
    },
    {
        "id":96,
        "name":"Asian Orange Chicken",
        "instructions":"Pour 1 1\/2 cups water, orange juice, lemon juice, rice vinegar, and soy sauce into a saucepan and set over medium-high heat. Stir in the orange zest, brown sugar, ginger, garlic, chopped onion, and red pepper flakes. Bring to a boil. Remove from heat, and cool 10 to 15 minutes. Place the chicken pieces into a resealable plastic bag. When contents of saucepan have cooled, pour 1 cup of sauce into bag. Reserve the remaining sauce. Seal the bag, and refrigerate at least 2 hours. In another resealable plastic bag, mix the flour, salt, and pepper. Add the marinated chicken pieces, seal the bag, and shake to coat. Heat the olive oil in a large skillet over medium heat. Place chicken into the skillet, and brown on both sides. Drain on a plate lined with paper towels, and cover with aluminum foil. Wipe out the skillet, and add the sauce. Bring to a boil over medium-high heat. Mix together the cornstarch and 2 tablespoons water; stir into the sauce. Reduce heat to medium low, add the chicken pieces, and simmer, about 5 minutes, stirring occasionally.",
        "creatorId":-1
    },
    {
        "id":97,
        "name":"Yellow Squash Casserole",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Place squash and onion in a large skillet over medium heat. Pour in a small amount of water. Cover, and cook until squash is tender, about 5 minutes. Drain well, and place in a large bowl. In a medium bowl, mix together cracker crumbs and cheese. Stir half of the cracker mixture into the cooked squash and onions. In a small bowl, mix together eggs and milk, then add to squash mixture. Stir in 1\/4 cup melted butter, and season with salt and pepper. Spread into a 9x13 inch baking dish. Sprinkle with remaining cracker mixture, and dot with 2 tablespoons butter. Bake in preheated oven for 25 minutes, or until lightly browned.",
        "creatorId":-1
    },
    {
        "id":98,
        "name":"The Best Meatballs",
        "instructions":"Combine beef, veal, and pork in a large bowl. Add garlic, eggs, cheese, parsley, salt and pepper. Blend bread crumbs into meat mixture. Slowly add the water 1\/2 cup at a time. The mixture should be very moist but still hold its shape if rolled into meatballs. (I usually use about 1 1\/4 cups of water). Shape into meatballs. Heat olive oil in a large skillet. Fry meatballs in batches. When the meatball is very brown and slightly crisp remove from the heat and drain on a paper towel. (If your mixture is too wet, cover the meatballs while they are cooking so that they hold their shape better.)",
        "creatorId":-1
    },
    {
        "id":99,
        "name":"Sarah's Easy Shredded Chicken Taco Filling",
        "instructions":"Place chicken breasts into a saucepan and pour in enough water to cover. Place over medium heat, bring to a boil, and simmer until chicken meat is no longer pink, 10 to 12 minutes. Transfer chicken breasts to a bowl, allow to cool, and shred the chicken meat with 2 forks. Heat vegetable oil in a small non-stick saucepan over medium heat, and cook and stir onion until translucent, 2 to 3 minutes. Mix in the shredded chicken, cumin, chili powder, and tomato sauce; bring to a boil. Reduce heat to low and simmer until chicken is hot and the flavors have blended, about 3 minutes.",
        "creatorId":-1
    },
    {
        "id":100,
        "name":"Jambalaya",
        "instructions":"Heat 1 tablespoon of peanut oil in a large heavy Dutch oven over medium heat. Season the sausage and chicken pieces with Cajun seasoning. Saute sausage until browned. Remove with slotted spoon, and set aside. Add 1 tablespoon peanut oil, and saute chicken pieces until lightly browned on all sides. Remove with a slotted spoon, and set aside. In the same pot, saute onion, bell pepper, celery and garlic until tender. Stir in crushed tomatoes, and season with red pepper, black pepper, salt, hot pepper sauce, Worcestershire sauce and file powder. Stir in chicken and sausage. Cook for 10 minutes, stirring occasionally. Stir in the rice and chicken broth. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes, or until liquid is absorbed.",
        "creatorId":-1
    },
    {
        "id":101,
        "name":"Quick and Easy Refried Beans",
        "instructions":"Heat canola oil in a heavy skillet over medium heat. Cook garlic cloves in hot oil, turning once, until brown on both sides, 4 to 5 minutes. Smash garlic cloves in skillet with a fork. Stir pinto beans, cumin, chili powder, and salt into mashed garlic and cook until beans are thoroughly heated, about 5 minutes. Stir occasionally. Smash bean mixture with a potato masher to desired texture. Squeeze lime juice over smashed beans and stir until combined.",
        "creatorId":-1
    },
    {
        "id":102,
        "name":"Enchiladas Verdes",
        "instructions":"Cover a large griddle with aluminum foil and preheat to medium-high. Cook the garlic, serrano peppers, and tomatillos on the hot griddle until toasted and blackened, turning occasionally, about 5 minutes for the garlic, 10 minutes for the peppers, and 15 minutes for the tomatillos. Remove to a bowl and allow to cool. Heat oil in a small, deep skillet to 350 degrees F (175 degrees C). Using kitchen tongs, fry the tortillas individually, turning them once. They shouldn't be in the hot oil for more than 5 seconds per side. Remove excess oil with paper towels and keep warm. Remember that the hotter the oil, the less that the tortillas will absorb. Place the toasted garlic, serrano peppers, tomatillos, and the water in a blender and blend until smooth; pour into a saucepan over medium heat and bring to a boil. Dissolve the chicken bouillon into the mixture, reduce heat to medium-low, and cook at a simmer until slightly thickened, about 10 minutes. The sauce shouldn't be too thick. Soak three tortillas in the sauce, one at a time, for a few seconds, fill them with shredded chicken, sprinkle the meat with some of the sauce, roll them and place them seam side down on a pasta bowl. Spoon a generous amount of sauce over them and top them with lettuce, cilantro, crema, and cotija cheese. Pour a little more sauce over the whole thing if desired. Repeat the procedure twice more. Serve immediately.",
        "creatorId":-1
    },
    {
        "id":103,
        "name":"Marinated Flank Steak",
        "instructions":"In a medium bowl, mix the oil, soy sauce, vinegar, lemon juice, Worcestershire sauce, mustard, garlic, and ground black pepper. Place meat in a shallow glass dish. Pour marinade over the steak, turning meat to coat thoroughly. Cover, and refrigerate for 6 hours. Preheat grill for medium-high heat. Oil the grill grate. Place steaks on the grill, and discard the marinade. Grill meat for 5 minutes per side, or to desired doneness.",
        "creatorId":-1
    },
    {
        "id":104,
        "name":"Hamburger Steak with Onions and Gravy",
        "instructions":"In a large bowl, mix together the ground beef, egg, bread crumbs, pepper, salt, onion powder, garlic powder, and Worcestershire sauce. Form into 8 balls, and flatten into patties. Heat the oil in a large skillet over medium heat. Fry the patties and onion in the oil until patties are nicely browned, about 4 minutes per side. Remove the beef patties to a plate, and keep warm. Sprinkle flour over the onions and drippings in the skillet. Stir in flour with a fork, scraping bits of beef off of the bottom as you stir. Gradually mix in the beef broth and sherry. Season with seasoned salt. Simmer and stir over medium-low heat for about 5 minutes, until the gravy thickens. Turn heat to low, return patties to the gravy, cover, and simmer for another 15 minutes.",
        "creatorId":-1
    },
    {
        "id":105,
        "name":"Spanakopita (Greek Spinach Pie)",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x9 inch square baking pan. Heat 3 tablespoons olive oil in a large skillet over medium heat. Saute onion, green onions and garlic, until soft and lightly browned. Stir in spinach and parsley, and continue to saute until spinach is limp, about 2 minutes. Remove from heat and set aside to cool. In a medium bowl, mix together eggs, ricotta, and feta. Stir in spinach mixture. Lay 1 sheet of phyllo dough in prepared baking pan, and brush lightly with olive oil. Lay another sheet of phyllo dough on top, brush with olive oil, and repeat process with two more sheets of phyllo. The sheets will overlap the pan. Spread spinach and cheese mixture into pan and fold overhanging dough over filling. Brush with oil, then layer remaining 4 sheets of phyllo dough, brushing each with oil. Tuck overhanging dough into pan to seal filling. Bake in preheated oven for 30 to 40 minutes, until golden brown. Cut into squares and serve while hot.",
        "creatorId":-1
    },
    {
        "id":106,
        "name":"German Hamburgers (Frikadellen)",
        "instructions":"Soak Kaiser roll in a bowl of water for 10 minutes. Drain, squeezing out excess water, and crumble into a large bowl. Mix crumbled roll with ground beef, ground pork, onion, parsley, egg, paprika, salt, and black pepper until well blended. Shape meat into large flattened meatballs. Heat a large nonstick skillet over medium heat; fry meatballs until browned and no longer pink in the center, about 5 minutes per side.",
        "creatorId":-1
    },
    {
        "id":107,
        "name":"Sweet Potato Pie I",
        "instructions":"Boil sweet potato whole in skin for 40 to 50 minutes, or until done.  Run cold water over the sweet potato, and remove the skin. Break apart sweet potato in a bowl.  Add butter, and mix well with mixer. Stir in sugar, milk, eggs, nutmeg, cinnamon and vanilla. Beat on medium speed until mixture is smooth.  Pour filling into an unbaked pie crust. Bake at 350 degrees F (175 degrees C) for 55 to 60 minutes, or until knife inserted in center comes out clean.  Pie will puff up like a souffle, and then will sink down as it cools.",
        "creatorId":-1
    },
    {
        "id":108,
        "name":"Lisa's Favorite Carne Asada Marinade",
        "instructions":"Combine the orange, lemon, and lime juice in a large glass or ceramic bowl along with the garlic, soy sauce, chipotle pepper, chili power, ground cumin, paprika, dried oregano, black pepper, and cilantro. Slowly whisk in the olive oil until marinade is well combined.  Remove one cup of the marinade and place in a small bowl, cover with plastic wrap and refrigerate for use after the meat is cooked. Place the flank steak between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the steak with the smooth side of a meat mallet to a thickness of 1\/4 inch.  After pounding, poke steak all over with a fork.  Add the meat to the marinade in the large bowl, cover, and allow to marinate in the refrigerator for 24 hours. Preheat an outdoor grill for medium-high heat, and lightly oil the grate. Remove the steak from the marinade and grill to desired doneness, about 5 minutes per side for medium rare. Discard used marinade.  Remove meat from heat and slice across the grain. Pour the one cup of reserved, unused marinade over the hot meat and serve immediately.",
        "creatorId":-1
    },
    {
        "id":109,
        "name":"Lebanese Fattoush",
        "instructions":"Toss together the lettuce, cabbage, radish, cucumber, red bell pepper, carrot, corn, tomato, onion, garlic, parsley, mint, olive oil, pomegranate seeds, and pomegranate syrup in a large bowl. Heat oil in a deep-fryer or saucepan to 350 degrees F (175 degrees C). Fry the pita breads until golden in color. Remove to cool on paper towels. Crush the bread into small pieces; sprinkle over the salad.",
        "creatorId":-1
    },
    {
        "id":110,
        "name":"Chef John's Buttermilk Fried Chicken",
        "instructions":"Toss together chicken pieces, black pepper, salt, paprika, rosemary, thyme, oregano, sage, white pepper, and cayenne in a large bowl to coat. Stir in buttermilk until chicken is coated. Refrigerate for 6 hours. Combine flour, salt, paprika, cayenne, garlic powder, white pepper, and onion powder in a large shallow dish. Remove chicken from the buttermilk and dredge each piece in the seasoned flour. Shake off any excess and transfer to a plate. Heat peanut oil in a large Dutch oven to 350 degrees F (175 degrees C). Add all the chicken to the pan and cook for 10 minutes. Turn chicken pieces and cook for another 10-15 minutes. Remove chicken from the oil and transfer to a cooling rack set over a paper towel lined baking sheet. Let sit for 10 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":111,
        "name":"Greek-Style Lemon Roasted Potatoes",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Put potato wedges into a large bowl. Drizzle olive oil and lemon juice over the wedges and toss to coat. Season potatoes with salt, oregano, and black pepper; toss again to coat. Spread potato wedges in a single layer in a 2 inch-deep pan. Pour chicken broth over the potatoes. Roast potatoes in preheated oven until tender and golden brown, about 1 hour.",
        "creatorId":-1
    },
    {
        "id":112,
        "name":"Delicious Ham and Potato Soup",
        "instructions":"Combine the potatoes, celery, onion, ham and water in a stockpot. Bring to a boil, then cook over medium heat until potatoes are tender, about 10 to 15 minutes. Stir in the chicken bouillon, salt and pepper. In a separate saucepan, melt butter over medium-low heat. Whisk in flour with a fork, and cook, stirring constantly until thick, about 1 minute. Slowly stir in milk as not to allow lumps to form until all of the milk has been added. Continue stirring over medium-low heat until thick, 4 to 5 minutes. Stir the milk mixture into the stockpot, and cook soup until heated through. Serve immediately.",
        "creatorId":-1
    },
    {
        "id":113,
        "name":"French Breakfast Puffs",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line cups with paper muffin liners. In a large bowl, whisk together flour, baking powder, salt, and nutmeg. In a separate bowl, cream together 1\/2 cup sugar and shortening. Beat in egg. Stir flour mixture into shortening mixture alternately with milk. Beat well. Spoon batter into prepared muffin cups. Bake in preheated oven for 20 to 25 minutes. While muffins are baking, combine 1\/2 cup sugar and 1 teaspoon cinnamon. Remove muffins from oven and muffin pan.  Immediately, dip the tops of the muffins into the melted margarine, then into the sugar\/cinnamon mixture.  Repeat with each muffin, until all muffin tops are covered. Serve warm.",
        "creatorId":-1
    },
    {
        "id":114,
        "name":"Hot Artichoke and Spinach Dip II",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Lightly grease a small baking dish. In a medium bowl, mix together cream cheese, mayonnaise, Parmesan cheese, Romano cheese, garlic, basil, garlic salt, salt and pepper. Gently stir in artichoke hearts and spinach. Transfer the mixture to the prepared baking dish. Top with mozzarella cheese. Bake in the preheated oven 25 minutes, until bubbly and lightly browned.",
        "creatorId":-1
    },
    {
        "id":115,
        "name":"Strawberry Pie II",
        "instructions":"Arrange half of strawberries in baked pastry shell. Mash remaining berries and combine with sugar in a medium saucepan. Place saucepan over medium heat and bring to a boil, stirring frequently. In a small bowl, whisk together cornstarch and water. Gradually stir cornstarch mixture into boiling strawberry mixture. Reduce heat and simmer mixture until thickened, about 10 minutes, stirring constantly. Pour mixture over berries in pastry shell. Chill for several hours before serving. In a small bowl, whip cream until soft peaks form. Serve each slice of pie with a dollop of whipped cream.",
        "creatorId":-1
    },
    {
        "id":116,
        "name":"Homemade Black Bean Veggie Burgers",
        "instructions":"If grilling, preheat an outdoor grill for high heat, and lightly oil a sheet of aluminum foil. If baking, preheat oven to 375 degrees F (190 degrees C), and lightly oil a baking sheet. In a medium bowl, mash black beans with a fork until thick and pasty. In a food processor, finely chop bell pepper, onion, and garlic. Then stir into mashed beans. In a small bowl, stir together egg, chili powder, cumin, and chili sauce. Stir the egg mixture into the mashed beans. Mix in bread crumbs until the mixture is sticky and holds together. Divide mixture into four patties. If grilling, place patties on foil, and grill about 8 minutes on each side. If baking, place patties on baking sheet, and bake about 10 minutes on each side.",
        "creatorId":-1
    },
    {
        "id":117,
        "name":"Perfect Baked Potato",
        "instructions":"Preheat the oven to 300 degrees F (150 degrees C). Scrub the potato, and pierce the skin several times with a knife or fork. Rub the skin with olive oil, then with salt. Place the potato in the preheated oven, and bake for 90 minutes, or until slightly soft and golden brown. Slice the potato down the center, and serve with butter and black pepper. Sprinkle shredded Cheddar cheese over the top, if desired.",
        "creatorId":-1
    },
    {
        "id":118,
        "name":"German Spaetzle Dumplings",
        "instructions":"Mix together flour, salt, white pepper, and nutmeg.  Beat eggs well, and add alternately with the milk to the dry ingredients.  Mix until smooth. Press dough through spaetzle maker, or a large holed sieve or metal grater. Drop a few at a time into simmering liquid.  Cook 5 to 8 minutes.  Drain well. Saute cooked spaetzle in butter or margarine.  Sprinkle chopped fresh parsley on top, and serve.",
        "creatorId":-1
    },
    {
        "id":119,
        "name":"Chicken Quesadillas",
        "instructions":"Preheat the broiler. Grease a baking sheet. Toss the chicken with the fajita seasoning, then spread onto the baking sheet. Place under the broiler and cook until the chicken pieces are no longer pink in the center, about 5 minutes. Preheat oven to 350 degrees F (175 degrees C). Heat the oil in a large saucepan over medium heat. Stir in the green bell peppers, red bell peppers, onion, and chicken. Cook and stir until the vegetables have softened, about 10 minutes. Layer half of each tortilla with the chicken and vegetable mixture, then sprinkle with the Cheddar cheese, bacon bits, and Monterey Jack. Fold the tortillas in half and Place onto a baking sheet. Bake quesadillas in the preheated oven until the cheeses have melted, about 10 minutes.",
        "creatorId":-1
    },
    {
        "id":120,
        "name":"baked tortilla chips",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Cut each tortilla into 8 chip sized wedges and arrange the wedges in a single layer on a cookie sheet. In a mister, combine the oil and lime juice. Mix well and spray each tortilla wedge until slightly moist. Combine the cumin, chili powder and salt in a small bowl and sprinkle on the chips. Bake for about 7 minutes. Rotate the pan and bake for another 8 minutes or until the chips are crisp, but not too brown. Serve with salsas, garnishes or guacamole.",
        "creatorId":-1
    },
    {
        "id":121,
        "name":"Candied Pecans",
        "instructions":"Preheat oven to 250 degrees F (120 degrees C). Mix sugar, cinnamon, and salt together in a bowl. Whisk egg white and water together in a separate bowl until frothy. Toss pecans in the egg white mixture. Mix sugar mixture into pecan mixture until pecans are evenly coated. Spread coated pecans onto a baking sheet. Bake in the preheated oven, stirring every 15 minutes, until pecans are evenly browned, 1 hour.",
        "creatorId":-1
    },
    {
        "id":122,
        "name":"Italian Spaghetti Sauce with Meatballs",
        "instructions":"In a large bowl, combine ground beef, bread crumbs, parsley, Parmesan, 1\/4 teaspoon black pepper, garlic powder and beaten egg.  Mix well and form into 12 balls.  Store, covered, in refrigerator until needed. In a large saucepan over medium heat, saute onion and garlic in olive oil until onion is translucent.  Stir in tomatoes, salt, sugar and bay leaf.  Cover, reduce heat to low, and simmer 90 minutes.  Stir in tomato paste, basil, 1\/2 teaspoon pepper and meatballs and simmer 30 minutes more.  Serve.",
        "creatorId":-1
    },
    {
        "id":123,
        "name":"Popcorn Salad",
        "instructions":"Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. In a large bowl, combine the mayonnaise, celery, 1 cup of the cheese, water chestnuts, 1\/2 cup bacon, carrots and chives.  Mix well.  Add popcorn and stir to coat.  Sprinkle with remaining cheese and bacon and serve immediately.",
        "creatorId":-1
    },
    {
        "id":124,
        "name":"Tzatziki Sauce",
        "instructions":"In a food processor or blender, combine yogurt, cucumber, olive oil, lemon juice, salt, pepper, dill and garlic.  Process until well-combined.  Transfer to a separate dish, cover and refrigerate for at least one hour for best flavor.",
        "creatorId":-1
    },
    {
        "id":125,
        "name":"Authentic Mexican Chili Rellenos",
        "instructions":"Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil. Place peppers onto the prepared baking sheet, and cook under the preheated broiler until the skin of the peppers has blackened and blistered, about 10 minutes. Turn the peppers often to blacken all sides. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 15 minutes. Rinse cooled peppers under cold water to peel off the skins, and cut a slit along the long side of each pepper to remove the seeds and core. Rinse the peppers inside and out, and pat dry with paper towels. Stuff the peppers with strips of the cheese. Whisk the egg yolks in a bowl with the baking powder. In a second metal bowl, beat the egg whites with an electric mixer until the whites form stiff peaks. Gently fold the beaten egg whites into the yolk mixture. Place flour into a shallow bowl. Heat the vegetable shortening in a skillet over medium heat. Roll each stuffed pepper in flour, tap off excess flour, and dip the peppers into the egg mixture to coat both sides. Gently lay the coated peppers into the hot shortening. Fry peppers until lightly golden brown and the cheese has melted, about 5 minutes per side.",
        "creatorId":-1
    },
    {
        "id":126,
        "name":"Authentic Mole Sauce",
        "instructions":"Toast guajillo chiles, ancho chiles, and chipotle chiles in a dry pan over medium heat, stirring constantly, until warm and aromatic, about 3 minutes. Transfer to the blender with chicken broth. Heat 2 cups chicken broth in a saucepan until it begins to simmer, about 5 minutes. Pour broth into a blender. Toast dinner roll pieces and tortilla strips in a dry pan over medium heat, stirring constantly, until lightly browned, about 3 minutes. Transfer to the blender with chicken broth and chiles Allow the chiles and toasted bread and tortillas to soak, fully submerged, in the chicken broth until softened, about 10 minutes. Blend the mixture until smooth. Cook tomatoes and tomatillos in a dry skillet on medium-high heat until soft and blackened, 3 to 4 minutes per side. Place tomatoes in the blender with the chile puree. Melt lard in a large skillet over medium heat. Stir in onion, garlic, peanuts, raisins, cumin seeds, thyme, cinnamon sticks, cloves, and allspice berries; cook and stir until onions are soft and golden, 5 to 8 minutes. Remove the cinnamon sticks and other whole spices; add onion mixture to the blender with the chile-tomato mixture and blend until smooth. Pour chile puree into a large saucepan over medium heat. Stir in chocolate chicken broth, sugar, and salt. Bring mixture to a simmer; stir until chocolate is melted and sauce is thickened and slightly reduced, 10 to 15 minutes.",
        "creatorId":-1
    },
    {
        "id":127,
        "name":"Fish Tacos",
        "instructions":"To make beer batter:  In a large bowl, combine flour, cornstarch, baking powder, and salt. Blend egg and beer, then quickly stir into the flour mixture (don't worry about a few lumps). To make white sauce:  In a medium bowl, mix together yogurt and mayonnaise. Gradually stir in fresh lime juice until consistency is slightly runny. Season with jalapeno, capers, oregano, cumin, dill, and cayenne. Heat oil in deep-fryer to 375 degrees F (190 degrees C). Dust fish pieces lightly with flour. Dip into beer batter, and fry until crisp and golden brown. Drain on paper towels. Lightly fry tortillas; not too crisp. To serve, place fried fish in a tortilla, and top with shredded cabbage, and white sauce.",
        "creatorId":-1
    },
    {
        "id":128,
        "name":"Best Hamburger Ever",
        "instructions":"Preheat a grill for high heat. In a large bowl, mix together the ground beef, onion, cheese, soy sauce, Worcestershire sauce, egg, onion soup mix, garlic, garlic powder, parsley, basil, oregano, rosemary, salt, and pepper. Form into 4 patties. Grill patties for 5 minutes per side on the hot grill, or until well done. Serve on buns with your favorite condiments.",
        "creatorId":-1
    },
    {
        "id":129,
        "name":"Beef Bulgogi",
        "instructions":"Place the beef in a shallow dish.  Combine soy sauce, sugar, green onion, garlic, sesame seeds, sesame oil, and ground black pepper in a small bowl.  Pour over beef.  Cover and refrigerate for at least 1 hour or overnight. Preheat an outdoor grill for high heat, and lightly oil the grate. Quickly grill beef on hot grill until slightly charred and cooked through, 1 to 2 minutes per side.",
        "creatorId":-1
    },
    {
        "id":130,
        "name":"naan",
        "instructions":"In a large bowl, dissolve yeast in warm water. Let stand about 10 minutes, until frothy. Stir in sugar, milk, egg, salt, and enough flour to make a soft dough. Knead for 6 to 8 minutes on a lightly floured surface, or until smooth. Place dough in a well oiled bowl, cover with a damp cloth, and set aside to rise. Let it rise 1 hour, until the dough has doubled in volume. Punch down dough, and knead in garlic. Pinch off small handfuls of dough about the size of a golf ball. Roll into balls, and place on a tray. Cover with a towel, and allow to rise until doubled in size, about 30 minutes. During the second rising, preheat grill to high heat. At grill side, roll one ball of dough out into a thin circle. Lightly oil grill. Place dough on grill, and cook for 2 to 3 minutes, or until puffy and lightly browned. Brush uncooked side with butter, and turn over. Brush cooked side with butter, and cook until browned, another 2 to 4 minutes. Remove from grill, and continue the process until all the naan has been prepared.",
        "creatorId":-1
    },
    {
        "id":131,
        "name":"Best Fried Green Tomatoes",
        "instructions":"Slice tomatoes 1\/2 inch thick. Discard the ends. Whisk eggs and milk together in a medium-size bowl. Scoop flour onto a plate. Mix cornmeal, bread crumbs and salt and pepper on another plate. Dip tomatoes into flour to coat. Then dip the tomatoes into milk and egg mixture. Dredge in breadcrumbs to completely coat. In a large skillet, pour vegetable oil (enough so that there is 1\/2 inch of oil in the pan) and heat over a medium heat. Place tomatoes into the frying pan in batches of 4 or 5, depending on the size of your skillet. Do not crowd the tomatoes, they should not touch each other. When the tomatoes are browned, flip and fry them on the other side. Drain them on paper towels.",
        "creatorId":-1
    },
    {
        "id":132,
        "name":"Simple Broiled Haddock",
        "instructions":"Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil and spray with cooking spray. Arrange haddock fillets on the prepared baking sheet. Mix onion powder, paprika, garlic powder, salt, black pepper, and cayenne pepper in a small bowl; sprinkle seasoning over haddock. Dot haddock with pieces of butter. Broil in the preheated oven until fish is easily flaked with a fork, 6 to 8 minutes. Serve with lemon wedges.",
        "creatorId":-1
    },
    {
        "id":133,
        "name":"Chinese Steamed Buns",
        "instructions":"Mix together yeast, 1 teaspoon sugar, 1\/4 cup flour, and 1\/4 cup warm water.  Allow to stand for 30 minutes. Mix in 1\/2 cup warm water, flour, salt, 2 tablespoons sugar, and vegetable oil.  Knead until dough surface is smooth and elastic.  Roll over in a greased bowl, and let stand until triple in size, about 2 1\/2 to 3 hours. Punch down dough, and spread out on a floured board.  Sprinkle baking powder evenly on surface, and knead for 5 minutes.  Divide dough into 2 parts, and place the piece you are not working with in a covered bowl.  Divide each half into 12 parts. Shape each part into a ball with smooth surface up. Put each ball on a wax paper square.   Let stand covered until double, about 30 minutes. Bring water to a boil in wok, and reduce heat to medium; the water should still be boiling.  Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate leaving 1 to 2 inches between the buns.  At least 2 inches space should be left between steam-plate and the wok.  Cover wok with lid.  Steam buns over boiling water for 15 minutes. REMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked.",
        "creatorId":-1
    },
    {
        "id":134,
        "name":"Stuffed Cabbage Rolls",
        "instructions":"In a medium saucepan, bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. Bring a large, wide saucepan of lightly salted water to a boil. Add cabbage leaves and cook for 2 to 4 minutes or until softened; drain. In a medium mixing bowl, combine the ground beef, 1 cup cooked rice, onion, egg, salt and pepper, along with 2 tablespoons of tomato soup. Mix thoroughly. Divide the beef mixture evenly among the cabbage leaves. Roll and secure them with toothpicks or string. In a large skillet over medium heat, place the cabbage rolls and pour the remaining tomato soup over the top. Cover and bring to a boil. Reduce heat to low and simmer for about 40 minutes, stirring and basting with the liquid often.",
        "creatorId":-1
    },
    {
        "id":135,
        "name":"Restaurant-Style Buffalo Chicken Wings",
        "instructions":"In a small bowl mix together the flour, paprika, cayenne pepper and salt. Place chicken wings in a large nonporous glass dish or bowl and sprinkle flour mixture over them until they are evenly coated. Cover dish or bowl and refrigerate for 60 to 90 minutes. Heat oil in a deep fryer to 375 degrees F (190 degrees C). The oil should be just enough to cover wings entirely, an inch or so deep. Combine the butter, hot sauce, pepper and garlic powder in a small saucepan over low heat. Stir together and heat until butter is melted and mixture is well blended. Remove from heat and reserve for serving. Fry coated wings in hot oil for 10 to 15 minutes, or until parts of wings begin to turn brown. Remove from heat, place wings in serving bowl, add hot sauce mixture and stir together. Serve.",
        "creatorId":-1
    },
    {
        "id":136,
        "name":"Grandmother's Buttermilk Cornbread",
        "instructions":"Preheat oven to 375 degrees F (175 degrees C). Grease an 8 inch square pan. Melt butter in large skillet. Remove from heat and stir in sugar. Quickly add eggs and beat until well blended. Combine buttermilk with baking soda and stir into mixture in pan. Stir in cornmeal, flour, and salt until well blended and few lumps remain. Pour batter into the prepared pan. Bake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted in the center comes out clean.",
        "creatorId":-1
    },
    {
        "id":137,
        "name":"Mashed Sweet Potatoes",
        "instructions":"Bring a large pot of salted water to a boil. Add potatoes and cook until tender, 20 to 30 minutes. With an electric mixer on low, blend potatoes, slowly adding milk, about 1\/2 a cup at a time. Use more or less to achieve desired texture. Add butter and maple syrup to taste. Blend until smooth. Serve warm.",
        "creatorId":-1
    },
    {
        "id":138,
        "name":"My Best Clam Chowder",
        "instructions":"Drain juice from clams into a large skillet over the onions, celery, potatoes and carrots. Add water to cover, and cook over medium heat until tender. Meanwhile, in a large, heavy saucepan, melt the butter over medium heat. Whisk in flour until smooth. Whisk in cream and stir constantly until thick and smooth. Stir in vegetables and clam juice. Heat through, but do not boil. Stir in clams just before serving. If they cook too much they get tough. When clams are heated through, stir in vinegar, and season with salt and pepper.",
        "creatorId":-1
    },
    {
        "id":139,
        "name":"Easy Lasagna II",
        "instructions":"In a large skillet over medium heat brown the ground beef. Drain the grease. Add spaghetti sauce and simmer for 5 minutes. In a large bowl, mix together the cottage cheese, 2 cups of the mozzarella cheese, eggs, half of the grated Parmesan cheese, dried parsley, salt and ground black pepper. To assemble, in the bottom of a 9x13 inch baking dish evenly spread 3\/4 cup of the sauce mixture. Cover with 3 uncooked lasagna noodles, 1 3\/4 cup of the cheese mixture, and 1\/4 cup sauce. Repeat layers once more: top with 3 noodles, remaining sauce, remaining mozzarella and Parmesan cheese. Add 1\/2 cup water to the edges of the pan. Cover with aluminum foil. Bake in a preheated 350 degree F(175 degrees C) oven for 45 minutes. Uncover and bake an additional 10 minutes. Let stand 10 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":140,
        "name":"Easy Swedish Meatball Sauce",
        "instructions":"Whisk together the beef stock, heavy cream, flour, soy sauce, black pepper, and rosemary in a large saucepan until smooth. Cook and stir over low heat until thickened, about 10 minutes, stirring occasionally. Stir in the meatballs, and continue cooking until meatballs are heated through, about 5 more minutes.",
        "creatorId":-1
    },
    {
        "id":141,
        "name":"Ten Minute Enchilada Sauce",
        "instructions":"Heat oil in a skillet over medium-high heat. Stir in flour and chili powder, reduce heat to medium, and cook until lightly brown, stirring constantly to prevent burning flour. Gradually stir in tomato sauce, water, cumin, garlic powder, and onion salt into the flour and chili powder until smooth, and continue cooking over medium heat approximately 10 minutes, or until thickened slightly. Season to taste with salt.",
        "creatorId":-1
    },
    {
        "id":142,
        "name":"Baked Spaghetti",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish. Bring a large pot of lightly salted water to a boil. Cook spaghetti in boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain. Heat a large skillet over medium heat; cook and stir beef and onion until meat is browned and onions are soft and translucent, about 7 minutes. Drain. Stir in spaghetti sauce and seasoned salt. Whisk eggs, Parmesan cheese, and butter in a large bowl. Mix in spaghetti to egg mixture and toss to coat. Place half the spaghetti mixture into baking dish. Top with half the cottage cheese, mozzarella, and meat sauce. Repeat layers. Cover with aluminum foil. Bake in preheated oven for 40 minutes. Remove foil and continue to bake until the cheese is melted and lightly browned, 20 to 25 minutes longer.",
        "creatorId":-1
    },
    {
        "id":143,
        "name":"Yummy Honey Chicken Kabobs",
        "instructions":"In a large bowl, whisk together oil, honey, soy sauce, and pepper. Before adding chicken, reserve a small amount of marinade to brush onto kabobs while cooking. Place the chicken, garlic, onions and peppers in the bowl, and marinate in the refrigerator at least 2 hours (the longer the better). Preheat the grill for high heat. Drain marinade from the chicken and vegetables, and discard marinade. Thread chicken and vegetables alternately onto the skewers. Lightly oil the grill grate. Place the skewers on the grill. Cook for 12 to 15 minutes, until chicken juices run clear. Turn and brush with reserved marinade frequently.",
        "creatorId":-1
    },
    {
        "id":144,
        "name":"Black Beans and Rice",
        "instructions":"In a stockpot over medium-high heat, heat the oil. Add the onion and garlic and saute for 4 minutes. Add the rice and saute for 2 minutes. Add the vegetable broth, bring to a boil, cover and lower the heat and cook for 20 minutes. Add the spices and black beans.",
        "creatorId":-1
    },
    {
        "id":145,
        "name":"Cajun Chicken Pasta",
        "instructions":"Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Place the chicken and the Cajun seasoning in a plastic bag. Shake to coat. In a large skillet over medium heat, saute the chicken in butter or margarine until almost tender (5 to 7 minutes). Add the red bell pepper, green bell pepper, mushrooms and green onion. Saute and stir for 2 to 3 minutes. Reduce heat. Add the cream, basil, lemon pepper, salt, garlic powder and ground black pepper. Heat through. Add the cooked linguine, toss and heat through. Sprinkle with grated Parmesan cheese and serve.",
        "creatorId":-1
    },
    {
        "id":146,
        "name":"Ground Turkey Taco Meat",
        "instructions":"Mix chili powder, cumin, paprika, salt, garlic powder, onion powder, oregano, and cayenne together in a small bowl. Cook turkey in a large nonstick skillet over medium heat, stirring to break up clumps, until no longer pink, 3 to 5 minutes. Stir in chili powder mixture and water. Reduce heat and simmer, stirring occasionally, until most of the liquid has been absorbed, about 10 minutes. Stir cider vinegar and brown sugar into the skillet. Simmer until flavors combine, 3 to 4 minutes. Transfer to a serving bowl.",
        "creatorId":-1
    },
    {
        "id":147,
        "name":"Hash Brown Casserole II",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). In a large bowl, combine hash browns, 1\/2 cup melted butter, cream of chicken soup, sour cream, chopped onion, Cheddar cheese, salt and pepper. Place mixture in a 3 quart casserole dish. In a medium saucepan over medium heat, saute cornflakes in 1\/4 cup melted butter, and sprinkle the mixture over the top of the casserole. Bake covered in preheated oven for 40 minutes.",
        "creatorId":-1
    },
    {
        "id":148,
        "name":"Strawberry Shortcake",
        "instructions":"Slice the strawberries and toss them with 1\/2 cup of white sugar. Set aside. Preheat oven to 425 degrees F (220 degrees C). Grease and flour one 8 inch round cake pan. In a medium bowl combine the flour, baking powder, 2 tablespoons white sugar and the salt. With a pastry blender cut in the shortening until the mixture resembles coarse crumbs. Make a well in the center and add the beaten egg and milk. Stir until just combined. Spread the batter into the prepared pan. Bake at 425 degrees F (220 degrees C) for 15 to 20 minutes or until golden brown. Let cool partially in pan on wire rack. Slice partially cooled cake in half, making two layers. Place half of the strawberries on one layer and top with the other layer. Top with remaining strawberries and cover with the whipped cream.",
        "creatorId":-1
    },
    {
        "id":149,
        "name":"Best Black Beans",
        "instructions":"In a medium saucepan, combine beans, onion, and garlic, and bring to a boil. Reduce heat to medium-low. Season with cilantro, cayenne, and salt. Simmer for 5 minutes, and serve.",
        "creatorId":-1
    },
    {
        "id":150,
        "name":"Heavenly Halibut",
        "instructions":"Preheat the oven broiler. Grease a baking dish. In a bowl, mix the Parmesan cheese, butter, mayonnaise, lemon juice, green onions, salt, and hot pepper sauce. Arrange the halibut fillets in the prepared baking dish. Broil halibut fillets 8 minutes in the prepared oven, or until easily flaked with a fork. Spread with the Parmesan cheese mixture, and continue broiling 2 minutes, or until topping is bubbly and lightly browned.",
        "creatorId":-1
    },
    {
        "id":151,
        "name":"Hot German Potato Salad III",
        "instructions":"Bring a large pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 30 minutes. Drain, cool and slice thin. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside, reserving drippings. Saute onions in bacon drippings until they are golden-brown. In a small bowl, whisk together the flour, sugar, salt, celery seed, and pepper.  Add to the sauteed onions and cook and stir until bubbly, then remove from heat.  Stir in water and vinegar, then return to the stove and bring to a boil, stirring constantly. Boil and stir for one minute. Carefully stir bacon and sliced potatoes into the vinegar\/water mixture, stirring gently until potatoes are heated through.",
        "creatorId":-1
    },
    {
        "id":152,
        "name":"The Best Vegetarian Chili in the World",
        "instructions":"Heat the olive oil in a large pot over medium heat. Stir in the onion, and season with bay leaves, cumin, oregano, and salt. Cook and stir until onion is tender, then mix in the celery, green bell peppers, jalapeno peppers, garlic, and green chile peppers. When vegetables are heated through, mix in the vegetarian burger crumbles. Reduce heat to low, cover pot, and simmer 5 minutes. Mix the tomatoes into the pot. Season chili with chili powder and pepper. Stir in the kidney beans, garbanzo beans, and black beans. Bring to a boil, reduce heat to low, and simmer 45 minutes. Stir in the corn, and continue cooking 5 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":153,
        "name":"Alfredo Sauce",
        "instructions":"Melt butter in a medium saucepan over medium low heat. Add cream and simmer for 5 minutes, then add garlic and cheese and whisk quickly, heating through. Stir in parsley and serve.",
        "creatorId":-1
    },
    {
        "id":154,
        "name":"Fruit Dip II",
        "instructions":"Using an electric mixer, blend cream cheese and marshmallow creme until mixed thoroughly.",
        "creatorId":-1
    },
    {
        "id":155,
        "name":"Quick and Easy Pancit",
        "instructions":"Place the rice noodles in a large bowl, and cover with warm water. When soft, drain, and set aside. Heat oil in a wok or large skillet over medium heat. Saute onion and garlic until soft. Stir in chicken cabbage, carrots and soy sauce. Cook until cabbage begins to soften. Toss in noodles, and cook until heated through, stirring constantly. Transfer pancit to a serving dish and garnish with quartered lemons.",
        "creatorId":-1
    },
    {
        "id":156,
        "name":"Salsa Chicken",
        "instructions":"Preheat oven to 375  degrees F (190 degrees C) Place chicken breasts in a lightly greased 9x13 inch baking dish. Sprinkle   on both sides of chicken breasts, and pour salsa over all. Bake at 375 degrees F (190 degrees C) for 25 to 35 minutes, or until chicken is tender and juicy and its juices run clear. Sprinkle chicken evenly with cheese, and continue baking for an additional 3 to 5 minutes, or until cheese is melted and bubbly. Top with sour cream if desired, and serve.",
        "creatorId":-1
    },
    {
        "id":157,
        "name":"Shepherd's Pie VI",
        "instructions":"Bring a large pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes. Drain and mash. Mix in butter, finely chopped onion and 1\/4 cup shredded cheese. Season with salt and pepper to taste; set aside. Bring a large pot of salted water to a boil.  Add carrots and cook until tender but still firm, about 15 minutes. Drain, mash and set aside. Preheat oven to 375 degrees F (190 degrees C.) Heat oil in a large frying pan. Add onion and cook until clear. Add ground beef and cook until well browned. Pour off excess fat, then stir in flour and cook 1 minute. Add ketchup and beef broth. Bring to a boil, reduce heat and simmer for 5 minutes. Spread the ground beef in an even layer on the bottom of a 2 quart casserole dish. Next, spread a layer of mashed carrots. Top with the mashed potato mixture and sprinkle with remaining shredded cheese. Bake in the preheated oven for 20 minutes, or until golden brown.",
        "creatorId":-1
    },
    {
        "id":158,
        "name":"Breadsticks",
        "instructions":"Dissolve 1 1\/2 teaspoons sugar and yeast in 1\/2 cup warm water in a bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes. Beat flour, oil, egg, salt, remaining sugar, and remaining warm water into yeast mixture until smooth, adding more flour if needed to form a soft dough. Turn dough onto a floured work surface; knead until smooth and elastic, 6 to 8 minutes. Place dough in a greased bowl, turning once to cover completely with oil. Cover bowl with a damp towel and place in a warm area until dough is doubled in size, about 40 minutes. Grease a baking sheet. Punch dough down and turn onto a floured work surface. Divide dough into 18 pieces and shape each into a 6-inch rope. Arrange dough pieces on the prepared baking sheet about 2 inches apart; cover with a towel or plastic wrap and let rise until doubled in size, about 25 minutes. Preheat oven to 400 degrees F (200 degrees C). Remove cover from dough. Bake in the preheated oven until golden brown, 10 to 12 minutes. Whisk butter and garlic salt together in a bowl; brush over each breadstick. Sprinkle Parmesan cheese over each.",
        "creatorId":-1
    },
    {
        "id":159,
        "name":"Louisiana Crawfish Etouffee",
        "instructions":"Combine the rice and 6 cups water in a saucepan, and bring to a boil. Cover, and reduce heat to low. Simmer for 15 to 20 minutes, until rice is tender and water has been absorbed. While the rice is cooking, melt the butter in a large skillet over medium heat. Add the onion, and saute until transparent. Stir in the garlic, and cook for a minute. Stir in the flour until well blended. Gradually stir in the tomato sauce and remaining 1 cup water, then add the crawfish tails and bring to a simmer. Add the green onions and season with salt, pepper, and Cajun seasoning. Simmer for 5 to 10 minutes over low heat, until the crawfish is cooked but not tough.  Serve over hot cooked rice.",
        "creatorId":-1
    },
    {
        "id":160,
        "name":"MeMe's Pasta Fagioli",
        "instructions":"Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Heat olive oil in a large saucepan over medium-high heat; saute carrot, celery, and onion until softened, 5 to 10 minutes. Add garlic and saute until fragrant, 1 to 2 minutes. Stir vegetable juice cocktail, chicken broth, parsley, basil, oregano, and black pepper into vegetable mixture; bring to a boil. Reduce heat and simmer soup for 20 minutes. Bring a large pot of lightly salted water to a boil. Cook ditalini pasta in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain. Stir cannellini beans and ground beef into soup; cook and stir until soup is heated through, about 10 minutes. Spoon about 1\/3 cup pasta into each serving bowl; ladle soup over pasta.",
        "creatorId":-1
    },
    {
        "id":161,
        "name":"Sausage, Peppers, Onions, and Potato Bake",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Heat 2 teaspoons olive oil in a large skillet over medium heat, and cook and stir the sausage until browned. Transfer the cooked sausage to a large baking dish. Pour 1\/4 cup of olive oil into the skillet, and cook the potatoes, stirring occasionally, until browned, about 10 minutes. Place the potatoes into the baking dish, leaving some oil in the skillet. Cook and stir the green and red peppers and onions in the hot skillet until they are beginning to soften, about 5 minutes. Add the vegetables to the baking dish. Pour wine and chicken stock over the vegetables and sausage, and sprinkle with Italian seasoning, salt, and pepper. Gently stir the sausage, potatoes, and vegetables together. Bake in the preheated oven until hot and bubbling, 20 to 25 minutes. Serve hot.",
        "creatorId":-1
    },
    {
        "id":162,
        "name":"Classic American-Style Potato Salad",
        "instructions":"Place potatoes in a pot with water to cover. Bring to a boil, cover and simmer, stirring to ensure even cooking, until a thin-bladed paring knife or a metal skewer inserted into a potato can be removed with no resistance, 25 to 30 minutes. Drain, rinse under cold water and drain again. Cool slightly. Cut warm potatoes into 3\/4-inch dice with a serrated knife. Layer them in a bowl, seasoning with vinegar, salt and pepper as you go. Cut eggs, celery and pickle in 1\/4-inch dice and thinly slice scallions. Add to potatoes, along with parsley. Stir in mayonnaise and mustard until everything is combined. Chill, covered, before serving.",
        "creatorId":-1
    },
    {
        "id":163,
        "name":"Funnel Cakes",
        "instructions":"In a deep-fryer, or heavy skillet, heat oil to 375 degrees F (190 degrees C). In a large bowl, beat milk and eggs together. Combine flour, baking powder, cinnamon and salt. Stir into the egg mixture until smooth. While covering the funnel hole with one hand, pour in 1 cup of batter. Start from the center in a swirling motion to make a 6 or 7 inch round. Fry on both sides until golden brown. Remove and drain on paper towels. Sprinkle with confectioners' sugar and serve warm.",
        "creatorId":-1
    },
    {
        "id":164,
        "name":"Louisiana Crawfish Boil",
        "instructions":"Fill a very large pot about 1\/3 full with water. Add the garlic, bay leaves, dry and liquid crab boil seasonings, salt, pepper, oranges, lemons, artichokes, and potatoes. Bring to a boil over high heat, then reduce to a simmer, and cook for 20 minutes. Stir in the corn, onions, mushrooms, and green beans; cook 15 minutes more. Stir in the sausage; cook 5 minutes more. Add the crawfish, return mixture to boil, then simmer until the crawfish shells turn bright red and the tails pull out easily, about 5 minutes. Test for doneness by peeling a crawfish. Be sure not to overcook, or crawfish will become tough. Drain well. Serve crawfish hot, Louisiana-style, spread over a picnic table covered with newspapers.",
        "creatorId":-1
    },
    {
        "id":165,
        "name":"Apple Crisp II",
        "instructions":"Preheat oven to 350 degrees F (175 degree C). Place the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all. Combine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture. Bake at 350 degrees F (175 degrees C) for about 45 minutes.",
        "creatorId":-1
    },
    {
        "id":166,
        "name":"Banana Crumb Muffins",
        "instructions":"Preheat oven to 375 degrees F (190 degrees C). Lightly grease 10 muffin cups, or line with muffin papers. In a large bowl, mix together 1 1\/2 cups flour, baking soda, baking powder and salt. In another bowl, beat together bananas, sugar, egg and melted butter. Stir the banana mixture into the flour mixture just until moistened. Spoon batter into prepared muffin cups. In a small bowl, mix together brown sugar, 2 tablespoons flour and cinnamon. Cut in 1 tablespoon butter until mixture resembles coarse cornmeal. Sprinkle topping over muffins. Bake in preheated oven for 18 to 20 minutes, until a toothpick inserted into center of a muffin comes out clean.",
        "creatorId":-1
    },
    {
        "id":167,
        "name":"Classic Fish and Chips",
        "instructions":"Place potatoes in a medium-size bowl of cold water. In a separate medium-size mixing bowl, mix together flour, baking powder, salt, and pepper. Stir in the milk and egg; stir until the mixture is smooth. Let mixture stand for 20 minutes. Preheat the oil in a large pot or electric skillet to 350 degrees F (175 degrees C). Fry the potatoes in the hot oil until they are tender. Drain them on paper towels. Dredge the fish in the batter, one piece at a time, and place them in the hot oil. Fry until the fish is golden brown. If necessary, increase the heat to maintain the 350 degrees F (175 degrees C) temperature.  Drain well on paper towels. Fry the potatoes again for 1 to 2 minutes for added crispness.",
        "creatorId":-1
    },
    {
        "id":168,
        "name":"Boston Baked Beans",
        "instructions":"Soak beans overnight in cold water. Simmer the beans in the same water until tender, approximately 1 to 2 hours. Drain and reserve the liquid. Preheat oven to 325 degrees F (165 degrees C). Arrange the beans in a 2 quart bean pot or casserole dish by placing a portion of the beans in the bottom of dish, and layering them with bacon and onion. In a saucepan, combine molasses, salt, pepper, dry mustard, ketchup, Worcestershire sauce and brown sugar. Bring the mixture to a boil and pour over beans. Pour in just enough of the reserved bean water to cover the beans. Cover the dish with a lid or aluminum foil. Bake for 3 to 4 hours in the preheated oven, until beans are tender. Remove the lid about halfway through cooking, and add more liquid if necessary to prevent the beans from getting too dry.",
        "creatorId":-1
    },
    {
        "id":169,
        "name":"Mai Tai",
        "instructions":"In a cocktail mixer full of ice, combine the spiced rum, coconut rum, grenadine, pineapple juice and orange juice. Shake vigorously and strain into glass full of ice.",
        "creatorId":-1
    },
    {
        "id":170,
        "name":"Chocolate Ganache",
        "instructions":"Place the chocolate into a medium bowl. Heat the cream in a small sauce pan over medium heat. Bring just to a boil, watching very carefully because if it boils for a few seconds, it will boil out of the pot. When the cream has come to a boil, pour over the chopped chocolate, and whisk until smooth. Stir in the rum if desired. Allow the ganache to cool slightly before pouring over a cake. Start at the center of the cake and work outward. For a fluffy frosting or chocolate filling, allow it to cool until thick, then whip with a whisk until light and fluffy.",
        "creatorId":-1
    },
    {
        "id":171,
        "name":"Grilled Sea Bass",
        "instructions":"Preheat grill for high heat. In a small bowl, stir together the garlic powder, onion powder, paprika, lemon pepper, and sea salt. Sprinkle seasonings onto the fish. In a small saucepan over medium heat, melt the butter with the garlic and parsley. Remove from heat when the butter has melted, and set aside. Lightly oil grill grate. Grill fish for 7 minutes, then turn and drizzle with butter. Continue cooking for 7 minutes, or until easily flaked with a fork. Drizzle with olive oil before serving.",
        "creatorId":-1
    },
    {
        "id":172,
        "name":"Dry Rub for Ribs",
        "instructions":"Mix together the brown sugar, paprika, salt, black pepper, and garlic powder. Rub into pork ribs. For best results, allow ribs to marinate overnight. Grill ribs as desired.",
        "creatorId":-1
    },
    {
        "id":173,
        "name":"Baked Asparagus with Balsamic Butter Sauce",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Arrange the asparagus on a baking sheet. Coat with cooking spray, and season with salt and pepper. Bake asparagus 12 minutes in the preheated oven, or until tender. Melt the butter in a saucepan over medium heat. Remove from heat, and stir in soy sauce and balsamic vinegar. Pour over the baked asparagus to serve.",
        "creatorId":-1
    },
    {
        "id":174,
        "name":"Rotisserie Chicken",
        "instructions":"Season the inside of the chicken with a pinch of salt. Place the chicken onto a rotisserie and set the grill on high. Cook for 10 minutes. During that time, quickly mix together the butter, 1 tablespoon of salt, paprika and pepper. Turn the grill down to medium and baste the chicken with the butter mixture. Close the lid and cook for 1 to 1 1\/2 hours, basting occasionally, until the internal temperature reaches 180 degrees F (83 degrees C) when taken in the thigh with a meat thermometer. Remove from the rotisserie and let stand for 10 to 15 minutes before cutting into pieces and serving.",
        "creatorId":-1
    },
    {
        "id":175,
        "name":"Lemon Chicken Piccata",
        "instructions":"Preheat oven to 200 degrees F (95 degrees C). Place a serving platter into the oven to warm. Season the chicken breast pieces with salt and pepper and dredge them in flour. Shake off excess flour. Heat the vegetable oil in a skillet; pan-fry the chicken pieces until golden brown on both sides, about 3 minutes per side. Work in batches and do not crowd skillet, adding oil as needed . Place the chicken pieces onto the warmed platter in the oven. When finished with all the chicken, drain most of the oil from the skillet, leaving a thin coating on the surface of the pan. Cook and stir the minced garlic in the skillet until fragrant, about 20 seconds. Pour in the chicken broth. Scrape and dissolve any brown bits from the bottom of the skillet. Stir in the lemon slices and bring the mixture to a boil. Let cook, stirring occasionally, until the sauce reduces to about 2\/3 cup, 5 to 8 minutes. Add the lemon juice and capers; simmer until the sauce is reduced and slightly thickened, about 5 minutes more. Drop the butter into the skillet and swirl it into the sauce by tilting the skillet until the butter is melted and incorporated. Add the parsley; remove from heat and set aside. Arrange the chicken medallions on serving plates and spoon sauce over each portion to serve.",
        "creatorId":-1
    },
    {
        "id":176,
        "name":"Homemade Four Cheese Ravioli",
        "instructions":"Mound the flour and salt together on a work surface and form a well. Beat the teaspoon of olive oil, 2 eggs, and water in a bowl. Pour half the egg mixture into the well. Begin mixing the egg with the flour with one hand; use your other hand to keep the flour mound steady. Add the remaining egg mixture and knead to form a dough. Knead the dough until smooth, 8 to 10 minutes; add more flour if the dough is too sticky. Form the dough into a ball and wrap tightly with plastic. Refrigerate for 1 hour. While the dough is resting, prepare the ravioli filling. Combine the ricotta cheese, cream cheese, mozzarella cheese, provolone cheese, egg, and parsley and mix well. Set the filling aside. Heat 2 tablespoons of olive oil in a skillet over medium heat. Add the crushed garlic and pesto sauce and cook for one minute. Pour in the heavy cream, raise the heat to high, and bring the sauce to a boil. Reduce the heat and simmer for 5 minutes. Add the Parmesan cheese and stir until the cheese melts. Remove the pan from the heat and keep warm. Meanwhile, in a separate saucepan, warm the marinara sauce over medium-low heat. Preheat an oven to 375 degrees F (190 degrees C). Beat the egg with the tablespoon of water to make the egg wash. Roll out the pasta dough into thin sheets no thicker than a nickel. To assemble the ravioli, brush the egg wash over a sheet of pasta. Drop the filling mixture on the dough by teaspoonfuls about one inch apart. Cover the filling with the top sheet of pasta, pressing out the air from around each portion of filling. Press firmly around the filling to seal. Cut into individual ravioli with a knife or pizza cutter. Seal the edges. Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the ravioli, and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 4 to 8 minutes. Drain well. Grease a baking sheet. Place the cooked ravioli on the sheet pan and bake in the preheated oven until brown, about 4 minutes. To serve the ravioli, divide them among four warmed serving bowls. Drizzle the marinara sauce over the ravioli and then top with the cream sauce.",
        "creatorId":-1
    },
    {
        "id":177,
        "name":"Ahi Poke Basic",
        "instructions":"In a medium size non-reactive bowl, combine Ahi, soy sauce, green onions, sesame oil, sesame seeds, chili pepper, and macadamia nuts; mix well. Refrigerate at least 2 hours before serving.",
        "creatorId":-1
    },
    {
        "id":178,
        "name":"Authentic Pho",
        "instructions":"Preheat oven to 425 degrees F (220 degrees C). Place beef bones on a baking sheet and roast in the preheated oven until browned, about 1 hour. Place onion on a baking sheet and roast in the preheated oven until blackened and soft, about 45 minutes. Place bones, onion, ginger, salt, star anise, and fish sauce in a large stockpot and cover with 4 quarts of water. Bring to a boil and reduce heat to low. Simmer on low for 6 to 10 hours. Strain the broth into a saucepan and set aside. Place rice noodles in large bowl filled with room temperature water and allow to soak for 1 hour. Bring a large pot of water to a boil and after the noodles have soaked, place them in the boiling water for 1 minute. Bring stock to a simmer. Divide noodles among 4 serving bowls; top with sirloin, cilantro, and green onion. Pour hot broth over the top. Stir and let sit until the beef is partially cooked and no longer pink, 1 to 2 minutes. Serve with bean sprouts, Thai basil, lime wedges, hoisin sauce, and chile-garlic sauce on the side.",
        "creatorId":-1
    },
    {
        "id":179,
        "name":"Beer Batter",
        "instructions":"In a small mixing bowl add flour, egg, garlic powder, and black pepper. Stir in 1 cup beer (you can add more than one cup to obtain your desired texture).",
        "creatorId":-1
    },
    {
        "id":180,
        "name":"Mexican Bean Salad",
        "instructions":"In a large bowl, combine beans, bell peppers, frozen corn, and red onion. In a small bowl, whisk together olive oil, red wine vinegar, lime juice, lemon juice, sugar, salt, garlic, cilantro, cumin, and black pepper.  Season to taste with hot sauce and chili powder. Pour olive oil dressing over vegetables; mix well.  Chill thoroughly, and serve cold.",
        "creatorId":-1
    },
    {
        "id":181,
        "name":"Amazingly Easy Irish Soda Bread",
        "instructions":"Preheat oven to 375 degrees F (190 degrees C). Lightly grease a large baking sheet. In a large bowl, mix together flour, sugar, baking soda,  baking powder, salt and margarine. Stir in 1 cup of buttermilk and egg. Turn dough out onto a lightly floured surface and knead slightly. Form dough into a round and place on prepared baking sheet. In a small bowl, combine melted butter with 1\/4 cup buttermilk; brush loaf with this mixture. Use a sharp knife to cut an 'X' into the top of the loaf. Bake in preheated oven until a toothpick inserted into the center of the loaf comes out clean,  45 to 50 minutes. Check for doneness after 30 minutes. You may continue to brush the loaf with the butter mixture while it bakes.",
        "creatorId":-1
    },
    {
        "id":182,
        "name":"Easy Baked Chicken Thighs",
        "instructions":"Preheat oven to 375 degrees F (190 degrees C). Place thighs in a baking dish. Season chicken thighs on all sides with garlic powder and onion flakes. Bake chicken in the preheated oven until no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).",
        "creatorId":-1
    },
    {
        "id":183,
        "name":"Korean BBQ Short Ribs (Gal-Bi)",
        "instructions":"Pour soy sauce, water, and vinegar into a large, non-metallic bowl. Whisk in brown sugar, white sugar, pepper, sesame oil, garlic, and onion until the sugars have dissolved. Submerge the ribs in this marinade, and cover with plastic wrap. Refrigerate 7 to 12 hours; the longer, the better. Preheat an outdoor grill for medium-high heat. Remove ribs from the marinade, shake off excess, and discard the marinade. Cook on preheated grill until the meat is no longer pink, 5 to 7 minutes per side.",
        "creatorId":-1
    },
    {
        "id":184,
        "name":"Breakfast Sausage",
        "instructions":"In a small, bowl, combine the sage, salt, ground black pepper, marjoram, brown sugar, crushed red pepper and cloves. Mix well. Place the pork in a large bowl and add the mixed spices to it. Mix well with your hands and form into patties. Saute the patties in a large skillet over medium high heat for 5 minutes per side, or until internal pork temperature reaches 160 degrees F (73 degrees C).",
        "creatorId":-1
    },
    {
        "id":185,
        "name":"Italian Sausage, Peppers, and Onions",
        "instructions":"Place the sausage in a large skillet over medium heat, and brown on all sides. Remove from skillet, and slice. Melt butter in the skillet. Stir in the yellow onion, red onion, and garlic, and cook 2 to 3 minutes. Mix in red bell pepper and green bell pepper. Season with basil, and oregano. Stir in white wine. Continue to cook and stir until peppers and onions are tender. Return sausage slices to skillet with the vegetables. Reduce heat to low, cover, and simmer 15 minutes, or until sausage is heated through.",
        "creatorId":-1
    },
    {
        "id":186,
        "name":"Perfect Lemon Curd",
        "instructions":"In a 2 quart saucepan, combine lemon juice, lemon zest, sugar, eggs, and butter. Cook over medium-low heat until thick enough to hold marks from whisk, and first bubble appears on surface, about 6 minutes.",
        "creatorId":-1
    },
    {
        "id":187,
        "name":"Oma's Rhubarb Cake",
        "instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch baking dish. In a large bowl, stir together 1 1\/4 cups sugar, baking soda, salt and 2 cups flour. Stir in the eggs and sour cream until smooth, then fold in the rhubarb. Pour into the prepared dish and spread evenly. In a smaller bowl, stir together the remaining 1 cup sugar and butter until smooth. Stir in 1\/4 cup flour until the mixture is crumbly. Sprinkle the mixture on top of the cake then dust lightly with cinnamon. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 45 minutes.",
        "creatorId":-1
    },
    {
        "id":188,
        "name":"Jamaican Style Curry Chicken",
        "instructions":"Heat vegetable oil in a skillet over medium-high heat; cook and stir onion, tomato, garlic, curry powder, habanero pepper, and thyme until onion is golden, about 7 minutes. Stir in chicken and cook until chicken is lightly browned, about 5 minutes. Pour water into the skillet, reduce heat to low; cover and simmer until chicken is no longer pink at the center, about 30 minutes. Season with salt.",
        "creatorId":-1
    },
    {
        "id":189,
        "name":"Leslie's Salty Grilled Potatoes",
        "instructions":"Preheat an outdoor grill for medium-low heat. Prepare four foil squares large enough to fold over one potato each.   Spread butter onto foil in a large enough area that the potato will be completely covered when rolled up.  Sprinkle salt, garlic, pepper, and Italian seasoning evenly over foil.  Roll each potato in the foil; puncture the package (including the potato) with a fork or knife a few times. Grill for 1 hour, or until soft, turning the potatoes often.  Serve with your favorite toppings.",
        "creatorId":-1
    },
    {
        "id":190,
        "name":"Eggplant Parmesan II",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Dip eggplant slices in egg, then in bread crumbs.  Place in a single layer on a baking sheet.  Bake in preheated oven for 5 minutes on each side. In a 9x13 inch baking dish spread spaghetti sauce to cover the bottom.  Place a layer of eggplant slices in the sauce.  Sprinkle with mozzarella and Parmesan cheeses.  Repeat with remaining ingredients, ending with the cheeses.  Sprinkle basil on top. Bake in preheated oven for 35 minutes, or until golden brown.",
        "creatorId":-1
    },
    {
        "id":191,
        "name":"Baked Greek Fries",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Spread potatoes on a baking sheet; drizzle with olive oil and stir potatoes to coat. Stir Greek seasoning, lemon zest, salt, and pepper together in a small bowl; sprinkle seasoning mixture evenly over potatoes. Bake in the preheated oven until tender when pierced with a fork, about 20 minutes. Crumble feta cheese over potatoes; sprinkle with mint.",
        "creatorId":-1
    },
    {
        "id":192,
        "name":"Quick and Easy Yorkshire Pudding",
        "instructions":"Preheat oven to 375  degrees F (190 degrees C). In a medium bowl, beat eggs with milk.  Stir in flour.  Set aside. Divide butter evenly into the twelve cups of a muffin tin, about 1\/2 teaspoon per cup.  Place tin in oven to melt butter, 2 to 5 minutes.  Remove tin from oven, and distribute batter evenly among buttery cups. Bake in preheated oven 5 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake 25 minutes more or until puffed and golden.",
        "creatorId":-1
    },
    {
        "id":193,
        "name":"Creamy Parmesan Polenta",
        "instructions":"Stir polenta and chicken broth together in a saucepan over medium heat; cook and stir until the polenta is heated through completely, about 5 minutes. Remove pan from heat. Stir Parmesan cheese, black pepper, and paprika with the polenta mixture.",
        "creatorId":-1
    },
    {
        "id":194,
        "name":"Swedish Meatballs (Svenska Kottbullar)",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Place the bread crumbs into a small bowl, and mix in the cream. Allow to stand until crumbs absorb the cream, about 10 minutes. While the bread is soaking, melt 1 teaspoon of butter in a skillet over medium heat, and cook and stir the onion until it turns light brown, about 10 minutes. Place onion into a mixing bowl; mix with the ground beef, ground pork, egg, brown sugar, salt, black pepper, nutmeg, allspice, and ginger. Lightly mix in the bread crumbs and cream. Melt 1 tablespoon of butter in a large skillet over medium heat. Pinch off about 1 1\/2 tablespoon of the meat mixture per meatball, and form into balls. Place the meatballs into the skillet, and cook just until the outsides are brown, about 5 minutes, turning the meatballs often. Insides of the meatballs will still be pink. Place browned meatballs into a baking dish, pour in chicken broth, and cover with foil. Bake in the preheated oven until the meatballs are tender, about 40 minutes. Remove meatballs to a serving dish. To make brown gravy, pour pan drippings into a saucepan over medium heat. Whisk the flour into the pan drippings until smooth, and gradually whisk in enough beef broth to total about 2 1\/2 cups of liquid. Bring the gravy to a simmer, whisking constantly until thick, about 5 minutes. Just before serving, whisk in the sour cream. Season to taste with salt and black pepper. Serve the gravy with the meatballs.",
        "creatorId":-1
    },
    {
        "id":195,
        "name":"Roasted Garlic Cauliflower",
        "instructions":"Preheat the oven to 450 degrees F (220 degrees C). Grease a large casserole dish. Place the olive oil and garlic in a large resealable bag. Add cauliflower, and shake to mix. Pour into the prepared casserole dish, and season with salt and pepper to taste. Bake for 25 minutes, stirring halfway through. Top with Parmesan cheese and parsley, and broil for 3 to 5 minutes, until golden brown.",
        "creatorId":-1
    },
    {
        "id":196,
        "name":"Barbacoa-Style Shredded Beef",
        "instructions":"Season beef chunks with salt and pepper on all sides. Heat oil in a large skillet over medium-high heat. Add beef in batches; cook until browned, about 1 minute per side. Transfer beef to a slow cooker. Combine beef broth, apple cider vinegar, lime juice, chipotle peppers, garlic, cumin, oregano, and cloves in a bowl. Season with salt and pepper and mix well. Pour over beef in the slow cooker. Stir in bay leaves. Cook on Low until beef is fork-tender, 8 to 10 hours. Discard bay leaves. Remove beef and shred using 2 forks. Return beef to the slow cooker to marinate in the sauce for at least 10 more minutes before serving.",
        "creatorId":-1
    },
    {
        "id":197,
        "name":"Chicken Tortilla Soup I",
        "instructions":"In a medium stock pot, heat oil over medium heat. Saute onion and garlic in oil until soft.  Stir in chili powder, oregano, tomatoes, broth, and water. Bring to a boil, and simmer for 5 to 10 minutes. Stir in corn, hominy, chiles, beans, cilantro, and chicken. Simmer for 10 minutes. Ladle soup into individual serving bowls, and top with crushed tortilla chips, avocado slices, cheese, and chopped green onion.",
        "creatorId":-1
    },
    {
        "id":198,
        "name":"Peanut Butter Pie",
        "instructions":"Mix the cream cheese, confectioners' sugar and peanut butter together until smooth. Fold in 1\/2 of the whipped topping. Spoon the mixture into the graham cracker crust. Place the remaining whipped topping over the top of the peanut butter mixture and garnish with the peanut butter cups. Chill for at least 2 hours or overnight before serving.",
        "creatorId":-1
    },
    {
        "id":199,
        "name":"Seven Layer Taco Dip",
        "instructions":"In a medium bowl, blend the   mix and refried beans. Spread the mixture onto a large serving platter. Mix the sour cream and cream cheese in a medium bowl. Spread over the refried beans. Top the layers with salsa. Place a layer of tomato, green bell pepper, green onions and lettuce over the salsa, and top with Cheddar cheese. Garnish with black olives.",
        "creatorId":-1
    },
    {
        "id":200,
        "name":"Maple Roasted Brussels Sprouts with Bacon",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Place Brussels sprouts in a single layer in a baking dish. Drizzle with olive oil and maple syrup; toss to coat. Sprinkle with bacon; season with salt and black pepper. Roast in the preheated oven until bacon is crispy and Brussels sprouts are caramelized, 45 minutes, stirring halfway through.",
        "creatorId":-1
    },
    {
        "id":201,
        "name":"Spicy Grilled Shrimp",
        "instructions":"Preheat grill for medium heat. In a small bowl, crush the garlic with the salt. Mix in cayenne pepper and paprika, and then stir in olive oil and lemon juice to form a paste. In a large bowl, toss shrimp with garlic paste until evenly coated. Lightly oil grill grate. Cook shrimp for 2 to 3 minutes per side, or until opaque. Transfer to a serving dish, garnish with lemon wedges, and serve.",
        "creatorId":-1
    },
    {
        "id":202,
        "name":"Easy Pizza Sauce I",
        "instructions":"Mix together the tomato paste, water, and olive oil. Mix well. Add garlic, salt and pepper to taste, oregano, basil, and rosemary. Mix well and let stand several hours to let flavors blend. No cooking necessary, just spread on dough.",
        "creatorId":-1
    },
    {
        "id":203,
        "name":"Sopapilla Cheesecake Pie",
        "instructions":"Preheat an oven to 350 degrees F (175 degrees C). Prepare a 9x13 inch baking dish with cooking spray. Beat the cream cheese with 1 cup of sugar and the vanilla extract in a bowl until smooth. Unroll the cans of crescent roll dough, and use a rolling pin to shape each piece into 9x13 inch rectangles. Press one piece into the bottom of a 9x13 inch baking dish. Evenly spread the cream cheese mixture into the baking dish, then cover with the remaining piece of crescent dough. Stir together 3\/4 cup of sugar, cinnamon, and butter. Dot the mixture over the top of the cheesecake. Bake in the preheated oven until the crescent dough has puffed and turned golden brown, about 30 minutes. Remove from the oven and drizzle with honey. Cool completely in the pan before cutting into 12 squares.",
        "creatorId":-1
    },
    {
        "id":204,
        "name":"Thai Sweet Sticky Rice With Mango (Khao Neeo Mamuang)",
        "instructions":"Combine the rice and water in a saucepan; bring to a boil; cover and reduce heat to low. Simmer until water is absorbed, 15 to 20 minutes. While the rice cooks, mix together 1 1\/2 cups coconut milk, 1 cup sugar, and 1\/2 teaspoon salt in a saucepan over medium heat; bring to a boil; remove from heat and set aside. Stir the cooked rice into the coconut milk mixture; cover. Allow to cool for 1 hour. Make a sauce by mixing together 1\/2 cup coconut milk, 1 tablespoon sugar, 1\/4 teaspoon salt, and the tapioca starch in a saucepan; bring to a boil. Place the sticky rice on a serving dish. Arrange the mangos on top of the rice. Pour the sauce over the mangos and rice. Sprinkle with sesame seeds.",
        "creatorId":-1
    },
    {
        "id":205,
        "name":"Cedar Planked Salmon",
        "instructions":"Soak the cedar planks for at least 1 hour in warm water. Soak longer if you have time. In a shallow dish, stir together the vegetable oil, rice vinegar, sesame oil, soy sauce, green onions, ginger, and garlic. Place the salmon fillets in the marinade and turn to coat. Cover and marinate for at least 15 minutes, or up to one hour. Preheat an outdoor grill for medium heat. Place the planks on the grate. The boards are ready when they start to smoke and crackle just a little. Place the salmon fillets onto the planks and discard the marinade. Cover, and grill for about 20 minutes. Fish is done when you can flake it with a fork. It will continue to cook after you remove it from the grill.",
        "creatorId":-1
    },
    {
        "id":206,
        "name":"Char Siu (Chinese BBQ Pork)",
        "instructions":"Cut pork with the grain into strips 1 1\/2- to 2-inches long; put into a large resealable plastic bag. Stir soy sauce, honey, ketchup, brown sugar, rice wine, hoisin sauce, red food coloring or red bean curd (see Cook's Note), and Chinese five-spice powder together in a saucepan over medium-low heat. Cook and stir until just combined and slightly warm, 2 to 3 minutes. Pour the marinade into the bag with the pork, squeeze air from the bag, and seal. Turn bag a few times to coat all pork pieces in marinade. Marinate pork in refrigerator, 2 hours to overnight. Preheat an outdoor grill for medium-high heat and lightly oil the grate. Remove pork from marinade and shake to remove excess liquid. Discard remaining marinade. Cook pork on preheated grill for 20 minutes. Put a small container of water onto the grill and continue cooking, turning the pork regularly, until cooked through, about 1 hour. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
        "creatorId":-1
    },
    {
        "id":207,
        "name":"Slow-Cooker Barbecue Ribs",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Season ribs with salt and pepper. Place in a shallow baking pan. Brown in oven 15 minutes. Turn over, and brown another 15 minutes; drain fat. In a medium bowl, mix together the ketchup, chili sauce, brown sugar, vinegar, oregano, Worcestershire sauce, hot sauce, and salt and pepper. Place ribs in slow cooker. Pour sauce over ribs, and turn to coat. Cover, and cook on Low 6 to 8 hours, or until ribs are tender.",
        "creatorId":-1
    },
    {
        "id":208,
        "name":"Chicken Arroz Caldo (Chicken Rice Porridge)",
        "instructions":"Heat the olive oil in a large pot over medium heat; cook and stir the onion, garlic, and ginger in the hot oil until fragrant, about 5 minutes. Add the chicken wings; cook and stir together for 1 minute. Stir the fish sauce into the pot, cover, and cook another 2 minutes. Pour the chicken broth into the pot. Add the sweet rice and stir. Bring the mixture to a boil; cover and cook for 10 minutes, stirring occasionally to assure the rice is not sticking to the bottom of the pot. Season with salt and pepper. Garnish with the green onion, and serve with lemon slices and additional fish sauce, if desired.",
        "creatorId":-1
    },
    {
        "id":209,
        "name":"Fried Chicken Wings",
        "instructions":"Season chicken wings lightly with seasoned salt. Mix flour, salt, black pepper, cayenne pepper, and paprika together in a wide, shallow bowl. Press wings into flour mixture to coat and arrange onto a large plate so they do not touch. Refrigerate coated wings for 15 to 30 minutes. Dredge wings again in flour mixture and return to the plate. Refrigerate wings again 15 to 30 minutes. Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Fry chicken wings in hot oil until crisp and no longer pink at the bone and the juices run clear, 9 to 12 minutes.  An instant-read thermometer inserted into the thickest part of the meat, near the bone should read 165 degrees F (74 degrees C). Transfer fried wings to a large stainless steel bowl. Drizzle sauce over the wings and toss to coat.",
        "creatorId":-1
    },
    {
        "id":210,
        "name":"Gooey Butter Cake III",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Mix cake mix, melted butter, 1 teaspoon vanilla, and 2 eggs with a spoon.  Pat into a 9x13-inch pan. Mix cream cheese, remaining 2 eggs, and remaining 1 teaspoon vanilla with an electric mixer.  Slowly beat in confectioner's sugar.  Pour over cake layer. Bake for 40 to 45 minutes. Cool.",
        "creatorId":-1
    },
    {
        "id":211,
        "name":"Slow Cooker Italian Beef for Sandwiches",
        "instructions":"Combine water with salt, ground black pepper, oregano, basil, onion salt, parsley, garlic powder, bay leaf, and salad dressing mix in a saucepan. Stir well, and bring to a boil. Place roast in slow cooker, and pour salad dressing mixture over the meat. Cover, and cook on Low for 10 to 12 hours, or on High for 4 to 5 hours. When done, remove bay leaf, and shred meat with a fork.",
        "creatorId":-1
    },
    {
        "id":212,
        "name":"French Onion Soup Gratinee",
        "instructions":"Melt butter in a large pot over medium-high heat. Stir in salt, red onions and sweet onions. Cook 35 minutes, stirring frequently, until onions are caramelized and almost syrupy. Mix chicken broth, beef broth, red wine and Worcestershire sauce into pot. Bundle the parsley, thyme, and bay leaf with twine and place in pot.  Simmer over medium heat for 20 minutes, stirring occasionally. Remove and discard the herbs. Reduce the heat to low, mix in vinegar and season with salt and pepper. Cover and keep over low heat to stay hot while you prepare the bread. Preheat oven broiler. Arrange bread slices on a baking sheet and broil 3 minutes, turning once, until well toasted on both sides. Remove from heat; do not turn off broiler. Arrange 4 large oven safe bowls or crocks on a rimmed baking sheet. Fill each bowl 2\/3 full with hot soup. Top each bowl with 1 slice toasted bread, 2 slice Gruyere cheese and 1\/4 of the Asiago or mozzarella cheese. Sprinkle a little bit of paprika over the top of each one. Broil 5 minutes, or until bubbly and golden brown. As it softens, the cheese will cascade over the sides of the crock and form a beautifully melted crusty seal. Serve immediately!",
        "creatorId":-1
    },
    {
        "id":213,
        "name":"3 Cheese Enchiladas",
        "instructions":"Preheat the oven to 350 degrees F (175 degrees C). Mix cream cheese with 2 cups salsa and 2 chopped green onions in a bowl until thoroughly combined; lightly stir 2 cups shredded Cheddar and 2 cups Monterey Jack cheese into cream cheese mixture. Spoon a scant 1\/2 cup of cheese filling in a line down the center of each tortilla and roll tortilla into a log around the filling. Repeat with remaining tortillas and cheese filling. Place rolled tortillas into a 9x13-inch baking dish. Spread top of enchiladas with remaining 1 cup salsa. Lightly mix remaining 1\/2 cup Cheddar cheese and 1\/2 cup Monterey Jack cheese in a bowl and spread over the salsa. Sprinkle with remaining green onions. Cover dish with aluminum foil. Bake in preheated oven until cheese is melted and bubbly, about 20 minutes.",
        "creatorId":-1
    },
    {
        "id":214,
        "name":"Blackened Chicken",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet. Heat a cast iron skillet over high heat for 5 minutes until it is smoking hot. Mix together the paprika, salt, cayenne, cumin, thyme, white pepper, and onion powder. Oil the chicken breasts with cooking spray on both sides, then coat the chicken breasts evenly with the spice mixture. Place the chicken in the hot pan, and cook for 1 minute. Turn, and cook 1 minute on other side. Place the breasts on the prepared baking sheet. Bake in the preheated oven until no longer pink in the center and the juices run clear, about 5 minutes.",
        "creatorId":-1
    },
    {
        "id":215,
        "name":"Best Bread Pudding with Vanilla Sauce",
        "instructions":"Preheat  oven to 375 degrees F (190 degrees C). Grease a 2-quart baking dish. In a mixing bowl, whisk 3 eggs, white sugar, 2 tablespoons of light brown sugar, 1\/2 teaspoon of cinnamon, 1\/4 cup of butter, and 3 cups of whole milk together, and gently stir in the bread cubes and raisins. Lightly spoon the mixture into the prepared baking dish. Bake in the preheated oven until browned and set in the middle, 50 to 55 minutes; cover the dish with foil after 30 minutes to prevent excessive browning. Let the pudding stand for 10 minutes before serving. For vanilla sauce, whisk 1\/2 cup of light brown sugar, the flour, a pinch of cinnamon, 1 egg, 2 tablespoons of melted butter, 1 1\/4 cups of whole milk,and salt together in a heavy saucepan until smooth. Heat over medium heat, whisking constantly, until thickened and the sauce coats the back of a spoon, 10 to 12 minutes. Stir in the vanilla extract. Pour sauce over warm bread pudding, or serve on the side in a bowl.",
        "creatorId":-1
    },
    {
        "id":216,
        "name":"Restaurant Style Beef and Broccoli",
        "instructions":"Whisk together the oyster sauce, sesame oil, sherry, soy sauce, sugar, and cornstarch in a bowl, and stir until the sugar has dissolved. Place the steak pieces into a shallow bowl, pour the oyster sauce mixture over the meat, stir to coat well, and marinate for at least 30 minutes in refrigerator. Heat vegetable oil in a wok or large skillet over medium-high heat, and stir in the ginger and garlic. Let them sizzle in the hot oil for about 1 minute to flavor the oil, then remove and discard. Stir in the broccoli, and toss and stir in the hot oil until bright green and almost tender, 5 to 7 minutes. Remove the broccoli from the wok, and set aside. Pour a little more oil into the wok, if needed, and stir and toss the beef with the marinade until the sauce forms a glaze on the beef, and the meat is no longer pink, about 5 minutes. Return the cooked broccoli to the wok, and stir until the meat and broccoli are heated through, about 3 minutes.",
        "creatorId":-1
    },
    {
        "id":217,
        "name":"Black Bean and Corn Salad II",
        "instructions":"Place lime juice, olive oil, garlic, salt, and cayenne pepper in a small jar. Cover with lid, and shake until ingredients are well mixed. In a salad bowl, combine beans, corn, avocado, bell pepper, tomatoes, green onions, and cilantro. Shake lime dressing, and pour it over the salad.  Stir salad to coat vegetables and beans with dressing, and serve.",
        "creatorId":-1
    },
    {
        "id":218,
        "name":"BBQ Spice Rub",
        "instructions":"Mix brown sugar, paprika, black pepper, salt, chili powder, garlic powder, onion powder, and cayenne pepper in a bowl. Store in an air-tight container or keep in the freezer in a sealable plastic bag.",
        "creatorId":-1
    },
    {
        "id":219,
        "name":"Meatball Sandwich",
        "instructions":"Preheat the oven to 350 degrees F (175 degrees C). In a medium bowl, gently mix by hand the ground beef, bread crumbs, Italian seasoning, garlic, parsley, Parmesan cheese, and egg. Shape into 12 meatballs, and place in a baking dish. Bake for 15 to 20 minutes in the preheated oven, or until cooked through. Meanwhile, cut the baguette in half lengthwise, and remove some of the bread from the inside to make a well for the meatballs. Brush with olive oil, and season with garlic powder and salt. Slip the baguette into the oven during the last 5 minutes of the meatball's time, or until lightly toasted. While the bread toasts, warm the spaghetti sauce in a saucepan over medium heat. When the meatballs are done, use a slotted spoon to transfer them to the sauce. Spoon onto the baguette and top with slices of provolone cheese. Return to the oven for 2 to 3 minutes to melt the cheese. Cool slightly, cut into servings, and enjoy!",
        "creatorId":-1
    },
    {
        "id":220,
        "name":"Garlic Parmesan Wing Sauce",
        "instructions":"Mix butter, Parmesan cheese, garlic power, onion salt, and black pepper together in a bowl.",
        "creatorId":-1
    },
    {
        "id":221,
        "name":"Fajita Marinade I",
        "instructions":"In a large resealable plastic bag, mix together the lime juice, water, olive oil, garlic, soy sauce, salt, and liquid smoke flavoring. Stir in cayenne and black pepper. Place desired meat in the marinade, and refrigerate at least 2 hours, or overnight. Cook as desired.",
        "creatorId":-1
    },
    {
        "id":222,
        "name":"Fudge",
        "instructions":"Place chocolate chips, sweetened condensed milk, and butter or margarine in large microwaveable bowl. Zap in microwave on medium until chips are melted, about 3-5 minute, stirring once or twice during cooking. Stir in nuts, if desired. Pour into well-greased 8x8-inch glass baking dish. Refrigerate until set.",
        "creatorId":-1
    },
    {
        "id":223,
        "name":"Southern Fried Catfish",
        "instructions":"In a small bowl, mix buttermilk, water, salt, and pepper. Pour mixture into a flat pan large enough to hold the fillets. Spread fish in one layer over bottom of pan, turning to coat each side, and set aside to marinate. In a 2 gallon resealable plastic bag, combine the cornmeal, flour, and seafood seasoning. Add fish to mixture, a few fillets at a time, and tumble gently to coat evenly. Heat oil in deep fryer to 365 degrees F (185 degrees C). Deep fry fillets until golden brown, about 3 minutes. Avoid overcrowding so fillets have room to brown properly. Fish should be slightly crisp outside, and moist and flaky inside. Drain on paper towels.",
        "creatorId":-1
    },
    {
        "id":224,
        "name":"Slow Cooker Lasagna",
        "instructions":"In a large skillet over medium heat cook the ground beef, onion, and garlic until brown. Add the tomato sauce, tomato paste, salt, and oregano and stir until well incorporated. Cook until heated through. In a large bowl mix together the cottage cheese, grated Parmesan cheese, and shredded mozzarella cheese. Spoon a layer of the meat mixture onto the bottom of the slow cooker. Add a double layer of the uncooked lasagna noodles. Break to fit noodles into slow cooker. Top noodles with a portion of the cheese mixture. Repeat the layering of sauce, noodles, and cheese until all the ingredients are used. Cover, and cook on LOW setting  for 4 to 6 hours.",
        "creatorId":-1
    },
    {
        "id":225,
        "name":"Creole Seasoning Blend",
        "instructions":"In a small bowl, combine onion powder, garlic powder, oregano, basil, thyme, black pepper, white pepper, cayenne pepper, paprika and salt. Store in an airtight container.",
        "creatorId":-1
    },
    {
        "id":226,
        "name":"Burrito Pie",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). In a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and garlic, and saute for 5 more minutes. Drain any excess fat, if desired. Mix in the olives, green chile peppers, tomatoes with green chile peppers, taco sauce and refried beans. Stir mixture thoroughly, reduce heat to low, and let simmer for 15 to 20 minutes. Spread a thin layer of the meat mixture in the bottom of a 4 quart casserole dish. Cover with a layer of tortillas followed by more meat mixture, then a layer of cheese. Repeat tortilla, meat, cheese pattern until all the tortillas are used, topping off with a layer of meat mixture and cheese. Bake for 20 to 30 minutes in the preheated oven, or until cheese is slightly brown and bubbly.",
        "creatorId":-1
    },
    {
        "id":227,
        "name":"Baked Buffalo Wings",
        "instructions":"Line a baking sheet with aluminum foil, and lightly grease with cooking spray. Place the flour, cayenne pepper, garlic powder, and salt into a resealable plastic bag, and shake to mix. Add the chicken wings, seal, and toss until well coated with the flour mixture. Place the wings onto the prepared baking sheet, and place into the refrigerator. Refrigerate at least 1 hour. Preheat oven to 400 degrees F (200 degrees C). Whisk together the melted butter and hot sauce in a small bowl. Dip the wings into the butter mixture, and place back on the baking sheet. Bake in the preheated oven until the chicken is no longer pink in the center, and crispy on the outside, about 45 minutes. Turn the wings over halfway during cooking so they cook evenly.",
        "creatorId":-1
    },
    {
        "id":228,
        "name":"Garden Fresh Tomato Soup",
        "instructions":"In a stockpot, over medium heat, combine the tomatoes, onion, cloves and chicken broth. Bring to a boil, and gently boil for about 20 minutes to blend all of the flavors. Remove from heat and run the mixture through a food mill into a large bowl, or pan. Discard any stuff left over in the food mill. In the now empty stockpot, melt the butter over medium heat. Stir in the flour to make a roux, cooking until the roux is a medium brown. Gradually whisk in a bit of the tomato mixture, so that no lumps form, then stir in the rest. Season with sugar and salt, and adjust to taste.",
        "creatorId":-1
    },
    {
        "id":229,
        "name":"Simple Turkey Chili",
        "instructions":"Heat the oil in a large pot over medium heat. Place turkey in the pot, and cook until evenly brown. Stir in onion, and cook until tender. Pour water into the pot. Mix in tomatoes, kidney beans, and garlic. Season chili powder, paprika, oregano, cayenne pepper, cumin, salt, and pepper.  Bring to a boil. Reduce heat to low, cover, and simmer 30 minutes.",
        "creatorId":-1
    },
    {
        "id":230,
        "name":"Fondant Potatoes",
        "instructions":"Preheat oven to 425 degrees F (220 degrees C). Cut off ends of russet potatoes, stand potatoes on end, and peel potatoes from top to bottom with a sharp knife to make each potato into a uniform cylinder. Cut each cylinder in half crosswise to make 6 potato cylinders about 2 inches long. Place potatoes into a bowl of cold water for about 5 minutes to remove starch from outsides; pat dry with paper towels. Place a heavy oven-proof skillet (such as a cast iron skillet) over high heat. Pour in vegetable oil; heat oil until it shimmers slightly. Place potato cylinders with best-looking ends into the hot oil, lower heat to medium-high, and pan-fry potatoes until well-browned, 5 to 6 minutes. Season with salt and black pepper. Flip the potatoes onto the opposite ends. As they cook, use a paper towel held with tongs to carefully blot out the oil from the skillet. Add butter and thyme sprigs to skillet. Pick up a thyme sprig with tongs and use it to paint butter over the top of the potatoes. Cook until butter foams and foam turns from white to a pale tan color. Season with more salt and pepper. Pour chicken stock into skillet. Transfer skillet to preheated oven and cook until potatoes are tender and creamy inside, about 30 minutes. If potatoes aren't tender, add 1\/4 cup more stock and let cook 10 more minutes. Place potatoes on a serving platter and spoon thyme-scented butter remaining in skillet over potatoes. Garnish with thyme sprigs. Let cool about 5 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":231,
        "name":"Pinto Beans With Mexican-Style Seasonings",
        "instructions":"Place pinto beans into a large pot and pour in enough water to cover by 2 to 3 inches. Let beans soak overnight. Drain beans, return to pot, and pour in fresh water to cover; add diced tomatoes, bacon, onion, chili powder, cumin, and garlic powder. Bring to a boil, reduce heat to low, and simmer for 3 hours. Stir cilantro and salt into bean mixture; simmer until beans are soft, about 1 more hour.",
        "creatorId":-1
    },
    {
        "id":232,
        "name":"Best Spinach Dip Ever",
        "instructions":"In a medium bowl, mix together mayonnaise, sour cream, dry leek soup mix, water chestnuts and chopped spinach. Chill in the refrigerator 6 hours, or overnight. Remove top and interior of sourdough bread. Fill with mayonnaise mixture. Tear removed bread chunks into pieces for dipping.",
        "creatorId":-1
    },
    {
        "id":233,
        "name":"Haluski - Cabbage and Noodles",
        "instructions":"Preheat oven to 300 degrees F (150 degrees C). Fill a large pot with lightly salted water and bring to a rolling boil. Stir in egg noodles and return to a boil. Cook noodles uncovered, stirring occasionally, until tender but still slightly firm, about 5 minutes. Drain well. Melt 1\/2 cup butter in a large skillet over medium-low heat; cook and stir onions until translucent, 5 to 10 minutes. Cook and stir remaining butter and cabbage into onions until cabbage is softened but not browned, 5 to 8 more minutes. Season with salt and black pepper. Place cooked noodles and cabbage mixture in a large roasting pan and stir gently to combine. Sprinkle with more salt and black pepper if desired. Bake in the preheated oven until golden brown on top, 30 to 40 minutes.",
        "creatorId":-1
    },
    {
        "id":234,
        "name":"Creamy Chocolate Frosting",
        "instructions":"In a medium bowl, sift together the confectioners' sugar and cocoa, and set aside. In a large bowl, cream butter until smooth, then gradually beat in sugar mixture alternately with evaporated milk. Blend in vanilla. Beat until light and fluffy. If necessary, adjust consistency with more milk or sugar.",
        "creatorId":-1
    },
    {
        "id":235,
        "name":"Chicken Souvlaki with Tzatziki Sauce",
        "instructions":"Combine 1\/4 cup olive oil, lemon juice, 2 cloves minced garlic, oregano, and 1\/2 teaspoon salt in a large resealable bag. Add chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 2 hours. Mix yogurt, cucumber, 1 tablespoon olive oil, vinegar, 1 clove minced garlic, and 1 pinch salt together in a bowl. Refrigerate tzatziki sauce for flavors to blend, 1 to 2 hours. Preheat an outdoor grill for medium-high heat and lightly oil the grate. Soak wooden skewers in a bowl of water for about 15 minutes. Remove chicken from marinade and thread onto the soaked skewers. Discard unused marinade. Cook the skewers on the preheated grill, turning frequently until nicely browned on all sides and chicken is no longer pink in the center, about 8 minutes per side. Serve with tzatziki sauce.",
        "creatorId":-1
    },
    {
        "id":236,
        "name":"Creme Brulee",
        "instructions":"Preheat oven to 300 degrees F (150 degrees C). Beat egg yolks, 4 tablespoons white sugar and vanilla extract in a mixing bowl until thick and creamy. Pour cream into a saucepan and stir over low heat until it almost comes to boil. Remove the cream from heat immediately.  Stir cream into the egg yolk mixture; beat until combined. Pour cream mixture into the top pan of a double boiler. Stir over simmering water until mixture lightly coats the back of a spoon, about 3 minutes. Remove mixture from heat immediately and pour into a shallow heat-proof dish. Bake in preheated oven for 30 minutes.  Remove from oven and cool to room temperature.  Refrigerate for at least 1 hour or overnight. Preheat oven to broil. In a small bowl combine remaining 2 tablespoons white sugar and brown sugar.  Sift this mixture evenly over custard.  Place dish under broiler until sugar melts, about 2 minutes.  Watch carefully so as not to burn. Remove from heat and allow to cool.  Refrigerate until custard is set again.",
        "creatorId":-1
    },
    {
        "id":237,
        "name":"Corn Fritters",
        "instructions":"Heat oil in a heavy pot or deep fryer to 365 degrees F (185 degrees C). In a medium bowl, combine flour, baking powder, salt and sugar. Beat together egg, milk, and melted shortening; stir into flour mixture. Mix in the corn kernels. Drop fritter batter by spoonfuls into the hot oil, and fry until golden. Drain on paper towels.",
        "creatorId":-1
    },
    {
        "id":238,
        "name":"Easy Indian Butter Chicken",
        "instructions":"Preheat oven to 375  degrees F (190 degrees C). Melt a few tablespoons of butter in a skillet over medium heat. Stir in onion and garlic, and cook slowly until the onion caramelizes to a dark brown, about 15 minutes. Meanwhile melt the remaining butter in a saucepan over medium-high heat along with the tomato sauce, heavy cream, salt, cayenne pepper, and garam masala. Bring to a simmer, then reduce heat to medium-low; cover, and simmer for 30 minutes, stirring occasionally. Then stir in caramelized onions. While the sauce is simmering, toss cubed chicken breast with vegetable oil until coated, then season with tandoori masala and spread out onto a baking sheet. Bake chicken in preheated oven until no longer pink in the center, about 12 minutes. Once done, add the chicken to the sauce and simmer for 5 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":239,
        "name":"Best Ever Blueberry Cobbler",
        "instructions":"Preheat oven to 375 degrees F (190 degrees C). In an 8 inch square baking dish, mix blueberries, 3 tablespoons sugar, and orange juice. Set aside. In a small bowl, thoroughly mix flour, baking powder, and salt. Set aside. In a medium bowl, cream butter and 1\/2 cup sugar until light and fluffy. Beat in egg and vanilla extract. Gradually add flour mixture, stirring just until ingredients are combined. Drop batter by rounded tablespoons over blueberry mixture. Try to cover as much of filling as possible. Bake in preheated oven for 35 to 40 minutes, until topping is golden brown and filling is bubbling.",
        "creatorId":-1
    },
    {
        "id":240,
        "name":"Blue Hawaiian Cocktail",
        "instructions":"Combine rum, blue Curacao, pineapple juice, cream of coconut, and 1 cup crushed ice in blender. Puree on high speed until smooth. Pour into chilled highball glass. Garnish with a slice of pineapple and a maraschino cherry.",
        "creatorId":-1
    },
    {
        "id":241,
        "name":"Dave's Low Country Boil",
        "instructions":"Heat a large pot of water over an outdoor cooker, or medium-high heat indoors. Add   Seasoning to taste, and bring to a boil. Add potatoes, and sausage, and cook for about 10 minutes. Add the corn and crab; cook for another 5 minutes, then add the shrimp when everything else is almost done, and cook for another 3 or 4 minutes. Drain off the water and pour the contents out onto a picnic table covered with newspaper. Grab a paper plate and a beer and enjoy!",
        "creatorId":-1
    },
    {
        "id":242,
        "name":"Old Fashioned Pineapple Upside-Down Cake",
        "instructions":"Preheat oven to 325 degrees F (165 degrees C). In a 10-inch heavy skillet with a heat-resistant handle (I use a cast iron skillet), melt 1\/2 cup butter over very low heat. Remove from heat, and sprinkle brown sugar evenly over pan. Arrange pineapple slices to cover bottom of skillet. Distribute cherries around pineapple; set aside. Sift together flour, baking powder, and salt. Separate the eggs into two bowls. In a large bowl, beat egg whites just until soft peaks form. Add granulated sugar gradually, beating well after each addition. Beat until medium-stiff peaks form. In a small bowl, beat egg yolks at high speed until very thick and yellow. With a wire whisk or rubber scraper, using an over-and-under motion, gently fold egg yolks and flour mixture into whites until blended. Fold in 1 tablespoon melted butter or margarine and almond extract. Spread batter evenly over pineapple in skillet. Bake until surface springs back when gently pressed with fingertip and a toothpick inserted in the center comes out clean, about 30 to 35 minutes. Loosen the edges of the cake with table knife. Cool the cake for 5 minutes before inverting onto serving plate.",
        "creatorId":-1
    },
    {
        "id":243,
        "name":"Authentic Mexican Shrimp Cocktail (Coctel de Camarones estilo Mexicano)",
        "instructions":"Mix onion with lime juice in a small bowl and allow to stand for 10 minutes. Meanwhile, toss shrimp, roma tomatoes, cucumber, celery, jalapeno, salt, and black pepper in a bowl until thoroughly combined. Whisk tomato and clam juice cocktail, ketchup, cilantro, and hot pepper sauce in a separate bowl; stir dressing into shrimp mixture. Gently fold in avocados. Cover and chill thoroughly, at least 1 hour.",
        "creatorId":-1
    },
    {
        "id":244,
        "name":"Chicken and Gnocchi Soup",
        "instructions":"Heat olive oil in a large pot over medium heat. Cook onion, celery, garlic, and carrots in the hot oil until onion is translucent, about 5 minutes. Stir in cubed chicken and chicken broth; bring to a simmer. Stir gnocchi into the simmering soup and cook until they begin to float, 3 to 4 minutes. Stir in spinach; cook until wilted, about 3 additional minutes. Whisk cornstarch into cold water until smooth. Stir cornstarch mixture and half-and-half into simmering soup. Cook until soup thickens slightly, about 5 minutes. Season to taste with salt and black pepper.",
        "creatorId":-1
    },
    {
        "id":245,
        "name":"Traditional Osso Buco",
        "instructions":"Dust the veal shanks lightly with flour. Melt the butter in a large skillet over medium to medium-high heat. Add the veal, and cook until browned on the outside. Remove to a bowl, and keep warm. Add two cloves of crushed garlic and onion to the skillet; cook and stir until onion is tender. Return the veal to the pan and mix in the carrot and wine. Simmer for 10 minutes. Pour in the tomatoes and beef stock, and season with salt and pepper. Cover, and simmer over low heat for 1 1\/2 hours, basting the veal every 15 minutes or so. The meat should be tender, but not falling off the bone. In a small bowl, mix together the parsley, 1 clove of garlic and lemon zest. Sprinkle the gremolata over the veal just before serving.",
        "creatorId":-1
    },
    {
        "id":246,
        "name":"Greek Orzo Salad",
        "instructions":"Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.  Drain artichoke hearts, reserving liquid. In large bowl combine pasta, artichoke hearts, tomato, cucumber, onion, feta, olives, parsley, lemon juice, oregano and lemon pepper.  Toss and chill for 1 hour in refrigerator. Just before serving, drizzle reserved artichoke marinade over salad.",
        "creatorId":-1
    },
    {
        "id":247,
        "name":"Best Ever Crab Cakes",
        "instructions":"In a medium bowl, whisk together egg, mayonnaise, lemon juice, red pepper flakes, tarragon, and scallions. Gently stir in crabmeat, being careful not to break up meat. Gradually mix in cracker crumbs, adding until desired consistency is achieved. Heat butter in a skillet over medium heat. Form crab mixture into 4 patties. Place patties in skillet, and cook until golden brown, about 5 to 6 minutes on each side.",
        "creatorId":-1
    },
    {
        "id":248,
        "name":"Sweet and Sour Pork III",
        "instructions":"Place cubed pork in a medium bowl, and season with 1 teaspoon salt, 1\/4 teaspoon sugar, and 1 teaspoon soy sauce. Mix in the egg white and green onions. Cover, and place in the refrigerator at least 1 hour. Heat 1 quart oil to 365 degrees F (185 degrees C) in a large, heavy saucepan or deep fryer. Coat the pork with 1\/2 cup cornstarch, and fry in the heated oil about 10 minutes, until evenly browned. Drain on paper towels. Heat 1 tablespoon oil in a wok over medium heat. Stir in the celery, green bell pepper, and onion, and cook until tender. Season with salt and sugar. Remove from heat, and set aside. In a large saucepan, mix 1 cup water, 1\/4 teaspoon salt, 3\/4 cup sugar, apple cider vinegar, ketchup, and 1\/2 teaspoon soy sauce. Bring to a boil, and stir in the cooked pork, celery mixture, and the pineapple chunks with juice. Return to boil, and mix in 2 tablespoons cornstarch and 1\/4 cup water to thicken. Cook until well blended.",
        "creatorId":-1
    },
    {
        "id":249,
        "name":"Southern-Style Chocolate Gravy",
        "instructions":"Whisk the cocoa, flour, and sugar together in a bowl until there are no lumps. Pour the milk into the mixture and whisk until well incorporated. Transfer the mixture to a saucepan and cook over medium heat, stirring frequently, until its consistency is similar to gravy, 7 to 10 minutes. Remove from heat and stir the butter and vanilla into the mixture until the butter is melted. Serve immediately.",
        "creatorId":-1
    },
    {
        "id":250,
        "name":"Cream Puffs",
        "instructions":"Mix together vanilla instant pudding mix, cream and milk. Cover and refrigerate to set. Preheat oven to 425 degrees F (220 degrees C). In a large pot, bring water and butter to a rolling boil. Stir in flour and salt until the mixture forms a ball. Transfer the dough to a large mixing bowl. Using a wooden spoon or stand mixer, beat in the eggs one at a time, mixing well after each. Drop by tablespoonfuls onto an ungreased baking sheet. Bake for 20 to 25 minutes in the preheated oven,  until golden brown. Centers should be dry. When the shells are cool, either split and fill them with the pudding mixture, or use a pastry bag to pipe the pudding into the shells.",
        "creatorId":-1
    },
    {
        "id":251,
        "name":"Southern Fried Cabbage",
        "instructions":"Place the bacon and vegetable oil into a large pot over medium heat. Season with salt and pepper. Cook for about 5 minutes, or until bacon is crisp. Add cabbage, onion, and sugar to the pot; cook and stir continuously for 5 minutes, until tender.",
        "creatorId":-1
    },
    {
        "id":252,
        "name":"Crab Legs with Garlic Butter Sauce",
        "instructions":"Cut a slit, length-wise, into the shell of each piece of crab. Melt the butter in a large skillet over medium heat; cook the garlic in the butter until translucent; stir in the parsley, salt, and pepper. Continue to heat mixture until bubbling. Add the crab legs; toss to coat; allow to simmer in the butter mixture until completely heated, 5 to 6 minutes.",
        "creatorId":-1
    },
    {
        "id":253,
        "name":"Garlic Mashed Potatoes",
        "instructions":"Bring a large pot of water to boil; add potatoes, and boil until soft, about 20 to 25 minutes. Drain, and place in a large bowl. Combine potatoes with milk, butter, garlic, salt, and pepper. Mix with an electric mixer or potato masher to your desired consistency. Sprinkle with sesame seeds.",
        "creatorId":-1
    },
    {
        "id":254,
        "name":"World's Best Pasta Sauce!",
        "instructions":"In a large pot or Dutch oven over medium heat, cook the sausage, beef, onion, and garlic until well browned; drain fat. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Mix in sugar and season with basil, fennel seed, Italian seasoning, salt, and pepper. Reduce heat to low, cover, and simmer 1 1\/2 hours, stirring occasionally.",
        "creatorId":-1
    },
    {
        "id":255,
        "name":"Manicotti Italian Casserole",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to boil. Pour in rigatoni, and cook until al dente, about 8 to 10 minutes. Drain, and set pasta aside. Meanwhile, brown ground beef and italian sausage in a large skillet over medium heat. With a slotted spoon, remove beef and sausage to a baking dish. Stir mushrooms, spaghetti sauce, and cooked pasta into the baking dish. Sprinkle cheese and pepperoni over the top. Bake in preheated oven until the cheese is brown and bubbly, about 20 minutes.",
        "creatorId":-1
    },
    {
        "id":256,
        "name":"Grilled Cod",
        "instructions":"Stack about 15 charcoal briquettes into a grill in a pyramid shape. If desired, drizzle coals lightly with lighter fluid and allow to soak for 1 minute before lighting coals with a match. Allow fire to spread to all coals, about 10 minutes, before spreading briquettes out into the grill; let coals burn until a thin layer of white ash covers the coals. Lightly oil the grates. Season both sides of cod with Cajun seasoning, lemon pepper, salt, and black pepper. Set fish aside on a plate. Heat butter in a small saucepan over medium heat, stir in lemon juice and green onion, and cook until onion is softened, about 3 minutes. Place cod onto oiled grates and grill until fish is browned and flakes easily, about 3 minutes per side; baste with butter mixture frequently while grilling. Allow cod to rest off the heat for about 5 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":257,
        "name":"Chicken Tinola",
        "instructions":"Heat the oil in a large pot over medium heat; cook and stir the onion and garlic in the hot oil until fragrant. Quickly stir the ginger and fish sauce into the onion and garlic mixture before adding the chicken; cook together for 5 minutes. Pour the chicken broth over the mixture and cook another 5 minutes. Add the chayote to the mixture and simmer until the chicken is no longer pink in the center, about 10 minutes more. Season with salt and pepper. Add the bok choy and spinach; cook until the spinach is just wilted, 1 to 2 minutes. Serve hot.",
        "creatorId":-1
    },
    {
        "id":258,
        "name":"Caldo de Res (Mexican Beef Soup)",
        "instructions":"Cut the meat from the beef bones into about 1\/2 inch pieces, leaving some on the bones. Heat a heavy soup pot over medium-high heat until very hot. Add the oil, tilting the pan to coat the bottom. Add the meat and bones, and season with salt and pepper. Cook and stir until thoroughly browned. Add 1 onion, and cook until onion is also lightly browned. Stir in the tomatoes and broth. The liquid should cover the bones by 1\/2 inch. If not, add enough water to compensate. Reduce heat to low, and simmer for 1 hour with the lid on loosely. If meat is not tender, continue cooking for another 10 minutes or so. Pour in the water, and return to a simmer. Add the carrot and 1\/4 cup cilantro, and cook for 10 minutes, then stir in the potato, corn and chayote. Simmer until vegetables are tender. Push the cabbage wedges  into the soup, and cook for about 10 more minutes. Ladle soup into large bowls, including meat vegetables and bones. Garnish with jalapenos, minced onion, and additional cilantro. Squeeze lime juice over all, and serve with radishes.",
        "creatorId":-1
    },
    {
        "id":259,
        "name":"Cornish Game Hens with Garlic and Rosemary",
        "instructions":"Preheat oven to 450 degrees F (230 degrees C). Rub hens with 1 tablespoon of the olive oil. Lightly season hens with salt and pepper. Place 1 lemon wedge and 1 sprig rosemary in cavity of each hen. Arrange in a large, heavy roasting pan, and arrange garlic cloves around hens. Roast in preheated oven for 25 minutes. Reduce oven temperature to 350 degrees F (175 degrees C). In a mixing bowl, whisk together wine, chicken broth, and remaining 2 tablespoons of oil; pour over hens. Continue roasting about 25 minutes longer, or until hens are golden brown and juices run clear. Baste with pan juices every 10 minutes. Transfer hens to a platter, pouring any cavity juices into the roasting pan. Tent hens with aluminum foil to keep warm. Transfer pan juices and garlic cloves to a medium saucepan and boil until liquids reduce to a sauce consistency, about 6 minutes. Cut hens in half lengthwise and arrange on plates. Spoon sauce and garlic around hens. Garnish with rosemary sprigs, and serve.",
        "creatorId":-1
    },
    {
        "id":260,
        "name":"Gyoza Sauce",
        "instructions":"Whisk together the rice vinegar, soy sauce, red pepper flakes, garlic, ginger, green onions, and sesame oil in a bowl; allow to sit 15 minutes before serving. Store in refrigerator up to 1 week.",
        "creatorId":-1
    },
    {
        "id":261,
        "name":"Italian Wedding Soup I",
        "instructions":"In medium bowl, combine meat, egg, bread crumbs, cheese, basil and onion powder; shape into 3\/4 inch balls. In large saucepan, heat broth to boiling; stir in escarole, orzo pasta, chopped carrot and meatballs. Return to boil, then reduce heat to medium. Cook at slow boil for 10 minutes, or until pasta is al dente. Stir frequently to prevent sticking.",
        "creatorId":-1
    },
    {
        "id":262,
        "name":"Kung Pao Chicken",
        "instructions":"To Make Marinade: Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil and 1 tablespoon cornstarch\/water mixture and mix together. Place chicken pieces in a glass dish or bowl and add marinade. Toss to coat. Cover dish and place in refrigerator for about 30 minutes. To Make Sauce: In a small bowl combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil, 1 tablespoon cornstarch\/water mixture, chili paste, vinegar and sugar. Mix together and add green onion, garlic, water chestnuts and peanuts. In a medium skillet, heat sauce slowly until aromatic. Meanwhile, remove chicken from marinade and saute in a large skillet until meat is white and juices run clear. When sauce is aromatic, add sauteed chicken to it and let simmer together until sauce thickens.",
        "creatorId":-1
    },
    {
        "id":263,
        "name":"Panna Cotta",
        "instructions":"Pour milk into a small bowl, and stir in the gelatin powder. Set aside. In a saucepan, stir together the heavy cream and sugar, and set over medium heat. Bring to a full boil, watching carefully, as the cream will quickly rise to the top of the pan. Pour the gelatin and milk into the cream, stirring until completely dissolved. Cook for one minute, stirring constantly. Remove from heat, stir in the vanilla and pour into six individual ramekin dishes. Cool the ramekins uncovered at room temperature. When cool, cover with plastic wrap, and refrigerate for at least 4 hours, but preferably overnight before serving.",
        "creatorId":-1
    },
    {
        "id":264,
        "name":"Pineapple Crisp",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Spread well-drained pineapple into a 9x9 inch square baking pan. In a medium bowl, mix together flour, sugar, baking powder, salt and egg until smooth. Spoon mixture evenly over pineapple. Pour melted butter over mixture and then sprinkle with cinnamon. Bake in preheated oven for 40 to 45 minutes. Serve hot or cold.",
        "creatorId":-1
    },
    {
        "id":265,
        "name":"Beignets",
        "instructions":"In a large bowl, dissolve yeast in warm water. Add sugar, salt, eggs, evaporated milk, and blend well. Mix in 4 cups of the flour and beat until smooth. Add the shortening, and then the remaining 3 cups of flour. Cover and chill for up to 24 hours. Roll out dough 1\/8 inch thick. Cut into 2 1\/2 inch squares. Fry in 360 degree F (180 degrees C) hot oil. If beignets do not pop up, oil is not hot enough. Drain onto paper towels. Shake confectioners' sugar on hot beignets. Serve warm.",
        "creatorId":-1
    },
    {
        "id":266,
        "name":"Glazed Carrots",
        "instructions":"Place carrots into a large saucepan, pour in enough water to reach depth of 1 inch, and bring to a boil. Reduce heat to low, cover, and simmer carrots until tender, 8 to 10 minutes. Drain and transfer to a bowl. Melt butter in the same saucepan; stir brown sugar, salt, and white pepper into butter until brown sugar and salt have dissolved. Transfer carrots into brown sugar sauce; cook and stir until carrots are glazed with sauce, about 5 more minutes.",
        "creatorId":-1
    },
    {
        "id":267,
        "name":"Indian Chicken Curry II",
        "instructions":"Heat olive oil in a skillet over medium heat. Saute onion until lightly browned. Stir in garlic, curry powder, cinnamon, paprika, bay leaf, ginger, sugar and salt. Continue stirring for 2 minutes. Add chicken pieces, tomato paste, yogurt, and coconut milk. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes. Remove bay leaf, and stir in lemon juice and cayenne pepper. Simmer 5 more minutes.",
        "creatorId":-1
    },
    {
        "id":268,
        "name":"Easy Italian Chicken II",
        "instructions":"To Marinate: Pour salad dressing into a large, resealable plastic bag. Add chicken breasts, seal bag and shake to coat. Place in refrigerator for at least 1 hour or overnight (the longer you marinate, the more taste the chicken will absorb). Preheat oven to 350 degrees F (175 degrees C). Remove chicken from bag, discarding remaining marinade. Place chicken in a lightly greased 9x13 inch baking dish and bake at 350 degrees F (175 degrees C) for 1 hour, or until chicken is cooked through and juices run clear. Note: Turn chicken occasionally while baking.",
        "creatorId":-1
    },
    {
        "id":269,
        "name":"Brazilian Cheese Bread (Pao de Queijo)",
        "instructions":"Preheat oven to 375  degrees F (190 degrees C). Pour olive oil, water, milk, and salt into a large saucepan, and place over high heat. When the mixture comes to a boil, remove from heat immediately, and stir in tapioca flour and garlic until smooth. Set aside to rest for 10 to 15 minutes. Stir the cheese and egg into the tapioca mixture until well combined, the mixture will be chunky like cottage cheese. Drop rounded, 1\/4 cup-sized balls of the mixture onto an ungreased baking sheet. Bake in preheated oven until the tops are lightly browned, 15 to 20 minutes.",
        "creatorId":-1
    },
    {
        "id":270,
        "name":"Sangria! Sangria!",
        "instructions":"In a large pitcher or bowl, mix together the brandy, lemon juice, lemonade concentrate, orange juice, red wine, triple sec, and sugar. Float slices of lemon, orange and lime, and maraschino cherries in the mixture. Refrigerate overnight for best flavor. For a fizzy sangria, add club soda just before serving.",
        "creatorId":-1
    },
    {
        "id":271,
        "name":"Downeast Maine Pumpkin Bread",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans. In a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans. Bake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean.",
        "creatorId":-1
    },
    {
        "id":272,
        "name":"Blackened Salmon Fillets",
        "instructions":"In a small bowl, mix paprika, cayenne pepper, onion powder, salt, white pepper, black pepper, thyme, basil and oregano. Brush salmon fillets on both sides with 1\/4 cup butter, and sprinkle evenly with the cayenne pepper mixture. Drizzle one side of each fillet with 1\/2 remaining butter. In a large, heavy skillet over high heat, cook salmon, butter side down, until blackened, 2 to 5 minutes. Turn fillets, drizzle with remaining butter, and continue cooking until blackened and fish is easily flaked with a fork.",
        "creatorId":-1
    },
    {
        "id":273,
        "name":"Chicken Enchiladas I",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). In a medium, non-stick skillet over medium heat, cook chicken until no longer pink and juices run clear. Drain excess fat. Cube the chicken and return it to the skillet. Add the onion, sour cream, Cheddar cheese, parsley, oregano and ground black pepper. Heat until cheese melts. Stir in salt, tomato sauce, water, chili powder, green pepper and garlic. Roll even amounts of the mixture in the tortillas. Arrange in a 9x13 inch baking dish. Cover with taco sauce and 3\/4 cup Cheddar cheese. Bake uncovered in the preheated oven 20 minutes. Cool 10 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":274,
        "name":"Famous Japanese Restaurant-Style Salad Dressing",
        "instructions":"In a blender, combine the minced onion, peanut oil, rice vinegar, water, ginger, celery, ketchup, soy sauce, sugar, lemon juice, garlic, salt and pepper . Blend on high speed for about 30 seconds or until all of the ingredients are well-pureed.",
        "creatorId":-1
    },
    {
        "id":275,
        "name":"Mexican Quesadilla Casserole",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Prepare a 13x9-inch baking dish with cooking spray. Heat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until beef is completely browned, 5 to 7 minutes; drain and discard grease. Stir tomato sauce, black beans, diced tomatoes with lime juice and cilantro, corn, and chopped green chiles into the ground beef mixture; season with chili powder, cumin, garlic, oregano, and red pepper flakes. Reduce heat to low and cook mixture at a simmer for 5 minutes. Spread about 1\/2 cup beef mixture into the bottom of the prepared baking dish; top with 3 tortillas, overlapping as needed. Spread another 1\/2 cup beef mixture over the tortillas. Sprinkle 1 cup Cheddar cheese over beef. Finish with layers of remaining tortillas, beef mixture, and Cheddar cheese, respectively. Bake in preheated oven until heated throughout and the cheese is melted, about 15 minutes. Cool 5 minutes before serving.",
        "creatorId":-1
    },
    {
        "id":276,
        "name":"Italian Breaded Pork Chops",
        "instructions":"Preheat oven to 325 degrees F (160 degrees C). In a small bowl, beat together the eggs and milk. In a separate small bowl, mix the bread crumbs, Parmesan cheese, and parsley. Heat the olive oil in a large, oven-proof skillet over medium heat. Stir in the garlic, and cook until lightly browned. Remove garlic, reserving for other uses. Dip each pork chop into the egg mixture, then into the bread crumb mixture, coating evenly. Place coated pork chops in the skillet, and brown abut 5 minutes on each side. Place the skillet and pork chops in the preheated oven, and cook 25 minutes, or to an internal temperature of 145 degrees F (63 degrees C).",
        "creatorId":-1
    },
    {
        "id":277,
        "name":"Coquilles Saint-Jacques",
        "instructions":"Melt butter in a large skillet over medium heat; saute shallots in the hot butter until translucent, 5 to 8 minutes. Stir mushrooms, salt, and black pepper into shallots. Turn heat to medium-high and cook, stirring often, until mushrooms are golden brown, about 10 minutes. Pour white wine over mushroom mixture, dissolving any browned bits of food on bottom of skillet into wine; bring to a simmer. Gently place scallops into wine and poach in the mushroom mixture until barely firm, about 2 minutes per side. Transfer scallops to a bowl. Strain mushroom mixture into another bowl, reserving mushrooms and cooking liquid separately. Return strained liquid to skillet, pour in any accumulated juices from scallops, and stir in cream. Bring to a boil and cook until cream sauce is reduced by about half, about 10 minutes. Stir often. Turn off heat and let mixture cool for 1 minute. Quickly whisk egg yolk into cream sauce until combined. Transfer skillet to a work surface (such as a heatproof countertop or cutting board) and stir cayenne pepper, 2 teaspoons tarragon, and lemon zest into sauce. Divide mushroom mixture into scallop shells, spreading mushrooms out to cover bottoms of shells; place about 3 scallops onto each portion. Spoon cream sauce over scallops to coat; let sauce drizzle down into mushrooms. Sprinkle lightly with Gruyere cheese and paprika or cayenne. Turn oven's broiler to high. Slightly crinkle a large sheet of aluminum foil and place onto a baking sheet. Place filled shells onto foil and press lightly to help them stay level. Broil about 10 inches from the heat source until sauce is bubbling and cheese is lightly browned, 5 to 6 minutes. Transfer to serving plates lined with napkins to prevent shells from tipping; garnish each portion with 2 crossed tarragon leaves.",
        "creatorId":-1
    },
    {
        "id":278,
        "name":"Easy Lemon Pepper Chicken Wings",
        "instructions":"Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Stir olive oil and lemon pepper together in a bowl. Fry the chicken wings in hot oil until no longer pink at the bone and the juices run clear, about 8 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Toss hot wings with olive oil mixture to coat.",
        "creatorId":-1
    },
    {
        "id":279,
        "name":"Sesame Seared Tuna",
        "instructions":"In a small bowl, stir together the soy sauce, mirin, honey and sesame oil. Divide into two equal parts. Stir the rice vinegar into one part and set aside as a dipping sauce. Spread the sesame seeds out on a plate. Coat the tuna steaks with the remaining soy sauce mixture, then press into the sesame seeds to coat. Heat olive oil in a cast iron skillet over high heat until very hot. Place steaks in the pan, and sear for about 30 seconds on each side. Serve with the dipping sauce and wasabi paste.",
        "creatorId":-1
    },
    {
        "id":280,
        "name":"Easy Mochi",
        "instructions":"Wrap red bean paste in aluminum foil and place in the freezer for at least 3 hours. Mix sweet rice flour and green tea powder thoroughly in a microwave-safe glass or ceramic bowl. Stir in water, then sugar. Mix until smooth. Cover bowl with plastic wrap. Cook the rice flour mixture in the microwave for 3 minutes and 30 seconds. Meanwhile, remove red bean paste from the freezer and divide paste into 8 equal balls. Set aside. Stir rice flour mixture and heat for another 15 to 30 seconds. Dust work surface with cornstarch. While the mochi is still hot from the microwave, begin rolling balls the size of about 2 tablespoons. Flatten the mochi ball and place 1 frozen red bean paste ball in the center. Pinch the mochi over the red bean paste until the paste is completely covered. Sprinkle with additional cornstarch and place mochi seam side down in a paper muffin liner to prevent sticking. Repeat until all the mochi and red bean paste is used.",
        "creatorId":-1
    },
    {
        "id":281,
        "name":"Basic Corn Muffins",
        "instructions":"Preheat oven to 400 degrees F (200 degrees C). Grease muffin pan or line with paper muffin liners. In a large bowl, mix together corn meal, flour, sugar, baking powder and salt. Add egg, oil and milk; stir gently to combine. Spoon batter into prepared muffin cups. Bake at 400 degrees F (200 degrees C) for 15 to 20 minutes, or until a toothpick inserted into a muffin comes out clean.",
        "creatorId":-1
    },
    {
        "id":282,
        "name":"Apple Turnovers",
        "instructions":"Combine the lemon and 4 cups water in a large bowl. Place the sliced apples in the water to keep them from browning. Melt butter in a large skillet over medium heat. Drain water from apples, and place them into the hot skillet. Cook and stir for about 2 minutes. Add brown sugar, and cinnamon, and cook, stirring, for 2 more minutes. Stir together cornstarch and 1 tablespoon water. Pour into the skillet, and mix well. Cook for another minute, or until sauce has thickened. Remove from heat to cool slightly. Preheat the oven to 400 degrees F (200 degrees C). Unfold puff pastry sheets, and repair any cracks by pressing them back together. Trim each sheet into a square. Then cut each larger square into 4 smaller squares. Spoon apples onto the center of each squares. Fold over from corner to corner into a triangle shape, and press edges together to seal. Place turnovers on a baking sheet, leaving about 1 inch between them. Bake for 25 minutes in the preheated oven, until turnovers are puffed and lightly browned. Cool completely before glazing. To make the glaze, mix together the confectioners' sugar, milk and vanilla in a small bowl. Adjust the thickness by adding more sugar or milk if necessary. Drizzle glaze over the cooled turnovers.",
        "creatorId":-1
    },
    {
        "id":283,
        "name":"Best Marinara Sauce Yet",
        "instructions":"In a food processor place Italian tomatoes, tomato paste, chopped parsley, minced garlic, oregano, salt, and pepper. Blend until smooth. In a large skillet over medium heat saute the finely chopped onion in olive oil for 2 minutes. Add the blended tomato sauce and white wine. Simmer for 30 minutes, stirring occasionally.",
        "creatorId":-1
    },
    {
        "id":284,
        "name":"Personal Portobello Pizza",
        "instructions":"Preheat the oven to 375 degrees F (190 degrees C). Place the mushroom on a baking sheet, and bake for 5 minutes in the preheated oven. Remove from the oven, and spread spaghetti sauce in the cup of the cap. Top with cheese, olives, pepperoni and garlic. Bake for an additional 20 minutes, or until cheese is melted and golden.",
        "creatorId":-1
    },
    {
        "id":285,
        "name":"Mint Juleps",
        "instructions":"Combine water, sugar and chopped mint leaves in a small saucepan.  Bring to a boil over high heat until the sugar is completely dissolved.  Allow syrup to cool, approximately 1 hour.  Pour syrup through a strainer to remove mint leaves Fill eight cups or frozen goblets with crushed ice and pour 4 ounces of bourbon and 1\/4 cup mint syrup in each.  (Proportions can be adjusted depending on each person's sweet tooth).  Top each cup with a mint sprig and a straw.  Trim straws to just barely protrude from the top of the cups.  Serve juleps on a silver platter.",
        "creatorId":-1
    },
    {
        "id":286,
        "name":"Wienerschnitzel",
        "instructions":"Place each veal cutlet between two pieces of plastic wrap, and pound with the flat side of a meat mallet until about 1\/4 inch thick. Dip in flour to coat. In a medium bowl, stir together the Parmesan cheese, eggs, parsley, salt, pepper, nutmeg and milk. Place bread crumbs on a plate. Dip each cutlet into the egg mixture, then press in the bread crumbs to coat. Place coated cutlets on a plate and refrigerate for 1 hour or overnight. Melt butter in a large skillet over medium heat. Cook the breaded cutlets until browned on each side, about 3 minutes per side. Remove to a serving platter, and pour the pan juices over them. Garnish with lemon slices.",
        "creatorId":-1
    },
    {
        "id":287,
        "name":"Honey Walnut Shrimp",
        "instructions":"Stir together the water and sugar in a small saucepan. Bring to a boil and add the walnuts. Boil for 2 minutes, then drain and place walnuts on a cookie sheet to dry. Whip egg whites in a medium bowl until foamy. Stir in the mochiko until it has a pasty consistency. Heat the oil in a heavy deep skillet over medium-high heat. Dip shrimp into the mochiko batter, and then fry in the hot oil until golden brown, about 5 minutes. Remove with a slotted spoon and drain on paper towels. In a medium serving bowl, stir together the mayonnaise, honey and sweetened condensed milk. Add shrimp and toss to coat with the sauce. Sprinkle the candied walnuts on top and serve.",
        "creatorId":-1
    },
    {
        "id":288,
        "name":"Real Sopapillas",
        "instructions":"In a large bowl, stir together flour, baking powder, salt and shortening. Stir in water; mix until dough is smooth. Cover and let stand for 20 minutes. Roll out on floured board until 1\/8 to 1\/4 inch thick. Cut into 3 inch squares. Heat oil in deep-fryer to 375 degrees F (190 degrees C). Fry until golden brown on both sides. Drain on paper towels and serve hot.",
        "creatorId":-1
    },
    {
        "id":289,
        "name":"Caprese Salad with Balsamic Reduction",
        "instructions":"Stir balsamic vinegar and honey together in a small saucepan and place over high heat. Bring to a boil, reduce heat to low, and simmer until the vinegar mixture has reduced to 1\/3 cup, about 10 minutes. Set the balsamic reduction aside to cool. Arrange alternate slices of tomato and mozzarella cheese decoratively on a serving platter. Sprinkle with salt and black pepper, spread fresh basil leaves over the salad, and drizzle with olive oil and the balsamic reduction.",
        "creatorId":-1
    },
    {
        "id":290,
        "name":"Moussaka",
        "instructions":"Lay the slices of eggplant on paper towels, sprinkle lightly with salt, and set aside for 30 minutes to draw out the moisture. Then in a skillet over high heat, heat the olive oil. Quickly fry the eggplant until browned. Set aside on paper towels to drain. In a large skillet over medium heat, melt the butter and add the ground beef, salt and pepper to taste, onions, and garlic. After the beef is browned, sprinkle in the cinnamon, nutmeg, fines herbs and parsley. Pour in the tomato sauce and wine, and mix well. Simmer for 20 minutes.  Allow to cool, and then stir in beaten egg. To make the bechamel sauce, begin by scalding the milk in a saucepan. Melt the butter in a large skillet over medium heat. Whisk in flour until smooth. Lower heat; gradually pour in the hot milk, whisking constantly until it thickens. Season with salt, and white pepper. Arrange a layer of eggplant in a greased 9x13 inch baking dish. Cover eggplant with all of the meat mixture, and then sprinkle 1\/2 cup of Parmesan cheese over the meat. Cover with remaining eggplant, and sprinkle another 1\/2 cup of cheese on top. Pour the bechamel sauce over the top, and sprinkle with the nutmeg. Sprinkle with the remaining cheese. Bake for 1 hour at 350 degrees F (175 degrees C).",
        "creatorId":-1
    },
    {
        "id":291,
        "name":"Cashew Crusted Chicken",
        "instructions":"Preheat oven to 375  degrees F (190 degrees C). Combine the preserves, mustard and curry powder in a large skillet and heat over low heat, stirring constantly, until preserves are completely melted and smooth. Place cashews in a shallow dish or bowl. Dip chicken breasts in skillet sauce, then roll in nuts to coat and place in a lightly greased 9x13 inch baking dish. Bake at 375 degrees F (190 degrees C) for 20 to 30 minutes. Boil any remaining sauce and serve on the side with the baked chicken.",
        "creatorId":-1
    },
    {
        "id":292,
        "name":"White Cheese Chicken Lasagna",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain, and rinse with cold water. Melt the butter in a large saucepan over medium heat. Cook the onion and garlic in the butter until tender, stirring frequently. Stir in the flour and salt, and simmer until bubbly. Mix in the broth and milk, and boil, stirring constantly, for 1 minute. Stir in 2 cups mozzarella cheese and 1\/4 cup Parmesan cheese. Season with the basil, oregano, and ground black pepper. Remove from heat, and set aside. Spread 1\/3 of the sauce mixture in the bottom of a 9x13 inch baking dish. Layer with 1\/3 of the noodles, the ricotta, and the chicken. Arrange 1\/3 of the noodles over the chicken,  and layer with 1\/3 of the sauce mixture, spinach, and the remaining 2 cups mozzarella cheese and 1\/2 cup Parmesan cheese. Arrange remaining noodles over cheese, and spread remaining sauce evenly over noodles. Sprinkle with parsley and 1\/4 cup Parmesan cheese. Bake 35 to 40 minutes in the preheated oven.",
        "creatorId":-1
    },
    {
        "id":293,
        "name":"Rosemary Braised Lamb Shanks",
        "instructions":"Sprinkle shanks with salt and pepper. Heat oil in heavy large pot or Dutch oven over medium-high heat. Working in batches, cook shanks until brown on all sides, about 8 minutes. Transfer shanks to plate. Add onions, carrots and garlic to pot and saute until golden brown, about 10 minutes. Stir in wine, tomatoes, chicken broth and beef broth. Season with rosemary and thyme. Return shanks to pot, pressing down to submerge. Bring to a boil, then reduce heat to medium-low.  Cover, and simmer until meat is tender, about 2 hours. Remove cover from pot. Simmer about 20 minutes longer. Transfer shanks to platter, place in a warm oven. Boil juices in pot until thickened, about 15 minutes.  Spoon over shanks.",
        "creatorId":-1
    },
    {
        "id":294,
        "name":"Linguine with Clam Sauce",
        "instructions":"Bring a large pot of salted water to boil. Cook pasta according to package directions. Combine clams with juice, butter, oil, minced garlic, parsley, basil, and pepper in a large saucepan. Place over medium heat until boiling. Serve warm over pasta.",
        "creatorId":-1
    },
    {
        "id":295,
        "name":"Garlic Butter Sauce I",
        "instructions":"In a small saucepan melt butter, add garlic and saute until cooked. Add dried oregano and dried basil and stir until heated through. Serve warm.",
        "creatorId":-1
    },
    {
        "id":296,
        "name":"Baked Chicken Schnitzel",
        "instructions":"Preheat oven to 425 degrees F (220 degrees C). Line a large baking sheet with aluminum foil and drizzle olive oil over foil. Place baking sheet in preheated oven. Flatten chicken breasts so they are all about 1\/4-inch thick. Season chicken with salt and pepper. Mix flour and paprika together on a large plate. Beat eggs with salt and pepper in a shallow bowl. Mix bread crumbs and lemon zest together on a separate large plate. Dredge each chicken piece in flour mixture, then egg, and then bread crumbs mixture and set aside in 1 layer on a clean plate. Repeat with remaining chicken. Remove baking sheet from oven and arrange chicken in 1 layer on the sheet. Drizzle more olive oil over each piece of coated chicken. Bake in the preheated oven for 5 to 6 minutes. Flip chicken and continue baking until no longer pink in the center and the breading is lightly browned, 5 to 6 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "creatorId":-1
    },
    {
        "id":297,
        "name":"Artichoke Spinach Lasagna",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C).   Spray a 9x13 inch baking dish with cooking spray. Bring a large pot of lightly salted water to a boil.  Add noodles and cook for 8 to 10 minutes or until al dente; drain. Spray a large skillet with cooking spray and heat on medium-high.  Saute onion and garlic for 3 minutes, or until onion is tender-crisp.  Stir in broth and rosemary; bring to a boil.  Stir in artichoke hearts and spinach; reduce heat, cover and simmer 5 minutes.  Stir in pasta sauce. Spread 1\/4 of the artichoke mixture in the bottom of the prepared baking dish; top with 3 cooked noodles.  Sprinkle 3\/4 cup mozzarella cheese over noodles.  Repeat layers 2 more times, ending with artichoke mixture and mozzarella cheese.  Sprinkle crumbled feta on top. Bake, covered, for 40 minutes.  Uncover, and bake 15 minutes more, or until hot and bubbly.  Let stand 10 minutes before cutting.",
        "creatorId":-1
    },
    {
        "id":298,
        "name":"Mom's Buttermilk Pancakes",
        "instructions":"Preheat and lightly grease a large skillet or electric griddle. Mix the flour, salt, and baking soda together in a bowl. Add the egg, buttermilk, and butter; stir together lightly, but keep it lumpy. The batter should look thick, spongy, and puffy. Drop 1\/3 cup of the batter onto the cooking surface, spreading lightly with the bottom of the cup. Cook until lightly-browned on each side, 1 to 2 minutes per side.",
        "creatorId":-1
    },
    {
        "id":299,
        "name":"English Muffins",
        "instructions":"Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in the sugar, stirring until dissolved. Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes. In a large bowl, combine the milk, yeast mixture, shortening and 3 cups flour. Beat until smooth. Add salt and rest of flour, or enough to make a soft dough. Knead. Place in greased bowl, cover, and let rise. Punch down. Roll out to about 1\/2 inch thick. Cut rounds with biscuit cutter, drinking glass, or empty tuna can. Sprinkle waxed paper with cornmeal and set the rounds on this to rise. Dust tops of muffins with cornmeal also. Cover and let rise 1\/2 hour. Heat greased griddle. Cook muffins on griddle about 10 minutes on each side on medium heat. Keep baked muffins in a warm oven until all have been cooked. Allow to cool and place in plastic bags for storage. To use, split and toast. Great with orange butter, or cream cheese and jam.",
        "creatorId":-1
    },
    {
        "id":300,
        "name":"Taco Dip I",
        "instructions":"In a medium-sized mixing bowl, combine cream cheese, sour cream and  . Spread this mixture in a 9-inch (or a little larger) round serving dish. Top the mixture with lettuce, Cheddar cheese, tomatoes, bell pepper and black olives.",
        "creatorId":-1
    },
    {
        "id":301,
        "name":"Amish White Bread",
        "instructions":"In a large bowl, dissolve the sugar in warm water, and then stir in yeast. Allow to proof until yeast resembles a creamy foam. Mix salt and oil into the yeast. Mix in flour one cup at a time. Knead dough on a lightly floured surface until smooth. Place in a well oiled bowl, and turn dough to coat. Cover with a damp cloth. Allow to rise until doubled in bulk, about 1 hour. Punch dough down. Knead for a few minutes, and divide in half. Shape into loaves, and place into two well oiled 9x5 inch loaf pans. Allow to rise for 30 minutes, or until dough has risen 1 inch above pans. Bake at 350 degrees F (175 degrees C) for 30 minutes.",
        "creatorId":-1
    },
    {
        "id":302,
        "name":"Parmesan-Crusted Pork Chops",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Spray a baking dish with cooking spray. Whisk egg in a shallow bowl. Mix Parmesan cheese and Cajun seasoning together on a plate. Dip each pork chop into egg. Press into Parmesan mixture until coated on both sides. Place in the prepared baking dish. Bake in the preheated oven until golden and an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), 35 to 40 minutes.",
        "creatorId":-1
    },
    {
        "id":303,
        "name":"Chef John's Panzanella",
        "instructions":"Pour bread into a large skillet and drizzle with 1\/4 cup olive oil, working in batches if necessary. Cook and stir bread over medium heat, adding more oil as needed, until bread cubes are golden and crispy on the outside, 7 to 12 minutes. Sprinkle Parmigiano-Reggiano over the top of the bread cubes; cook and stir until cheese is melted onto bread, and bread is crispy on the outside but still chewy on the inside, 3 to 4 minutes more. Cool completely. Combine tomatoes, red wine vinegar, extra virgin olive oil, garlic, sugar, salt, and black pepper together in a bowl until well-mixed. Cover bowl with plastic wrap and let sit at room temperature until flavors combine, about 20 minutes. Toss basil into tomato mixture; add bread cubes and stir. Let salad sit at room temperature 3 to 4 minutes; if the liquid is completely absorbed, add more vinegar and extra virgin olive oil to taste. Season with salt and black pepper.",
        "creatorId":-1
    },
    {
        "id":304,
        "name":"Buttermilk Pie",
        "instructions":"Preheat oven to 350 degrees (175 degrees C). Beat eggs until frothy; add butter, sugar and flour. Beat until smooth. Stir in buttermilk, vanilla, lemon juice and nutmeg; pour into pie shell. Bake for 40 to 60 minutes, or until center is firm.",
        "creatorId":-1
    },
    {
        "id":305,
        "name":"Corn in a Cup (Elote en Vaso)",
        "instructions":"Place corn in a saucepan and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 2 to 3 minutes. Drain and return corn to saucepan. Spoon 3\/4 cup corn into 10 serving bowls; add 2 tablespoons butter to each and stir until butter is melted. Mix 1\/4 cup lime juice and 1\/4 cup crema Mexicana into each bowl; sprinkle a generous amount of chili powder over each. Season with salt. Top each serving with 2 tablespoons cotija cheese and hot sauce; garnish with a lime wedge.",
        "creatorId":-1
    },
    {
        "id":306,
        "name":"Rajas Poblanas (Poblano Strips)",
        "instructions":"Blend the crema, cream cheese, and chicken bouillon in a blender until smooth; set aside. Place the peppers on a large griddle over medium-high heat. Roast until the skin blisters and turns black. Remove peppers from griddle and place in a plastic bag, allowing them to sweat for 5 minutes. Transfer to a plate to cool. Peel and discard the outer skin of the peppers; halve length-wise and remove the seeds and veins. Slice into thick strips. Set aside. Heat the vegetable oil in a large saucepan over medium-high heat; cook the onion in the hot oil until tender, about 5 minutes. Stir the corn into the onions, reduce the heat to medium, and cook another 5 minutes. Add the poblano strips to the saucepan. Pour the cream mixture over the vegetables and bring to a simmer; cook at a simmer until hot, about 5 minutes more.",
        "creatorId":-1
    },
    {
        "id":307,
        "name":"Best Ever Jalapeno Poppers",
        "instructions":"In a medium bowl, mix the cream cheese, Cheddar cheese and bacon bits. Spoon this mixture into the jalapeno pepper halves. Put the milk and flour into two separate small bowls. Dip the stuffed jalapenos first into the milk then into the flour, making sure they are well coated with each. Allow the coated jalapenos to dry for about 10 minutes. Dip the jalapenos in milk again and roll them through the breadcrumbs. Allow them to dry, then repeat to ensure  the entire surface of the jalapeno is coated. In a medium skillet, heat the oil to 365 degrees F ( 180 degrees C). Deep fry the coated jalapenos 2 to 3 minutes each, until golden brown. Remove and let drain on a paper towel.",
        "creatorId":-1
    },
    {
        "id":308,
        "name":"Chicken Tikka Masala",
        "instructions":"In a large bowl, combine yogurt, lemon juice, 2 teaspoons cumin, cinnamon, cayenne, black pepper, ginger, and salt. Stir in chicken, cover, and refrigerate for 1 hour. Preheat a grill for high heat. Lightly oil the grill grate. Thread chicken onto skewers, and discard marinade. Grill until juices run clear, about 5 minutes on each side. Melt butter in a large heavy skillet over medium heat. Saute garlic and jalapeno for 1 minute. Season with 2 teaspoons cumin, paprika, and 1 teaspoon salt. Stir in tomato sauce and cream. Simmer on low heat until sauce thickens, about 20 minutes. Add grilled chicken, and simmer for 10 minutes. Transfer to a serving platter, and garnish with fresh cilantro.",
        "creatorId":-1
    },
    {
        "id":309,
        "name":"Indian Style Basmati Rice",
        "instructions":"Place rice into a bowl with enough water to cover. Set aside to soak for 20 minutes. Heat the oil in a large pot or saucepan over medium heat. Add the cinnamon stick, cardamom pods, cloves, and cumin seed. Cook and stir for about a minute, then add the onion to the pot. Saute the onion until a rich golden brown, about 10 minutes. Drain the water from the rice, and stir into the pot. Cook and stir the rice for a few minutes, until lightly toasted. Add salt and water to the pot, and bring to a boil. Cover, and reduce heat to low. Simmer for about 15 minutes, or until all of the water has been absorbed. Let stand for 5 minutes, then fluff with a fork before serving.",
        "creatorId":-1
    },
    {
        "id":310,
        "name":"Cheese Fondue",
        "instructions":"Simmer wine in fondue pot. Add Swiss cheese, Gruyere cheese, 1\/4 pound at a time. Stir after each addition of cheese until melted. Stir in flour. When all the cheese has melted, stir in salt and nutmeg. Serve with cut-up French bread.",
        "creatorId":-1
    },
    {
        "id":311,
        "name":"Penne with Chicken and Asparagus",
        "instructions":"Bring a large pot of lightly salted water to boil. Add pasta, and cook until al dente, about 8 to 10 minutes. Drain, and set aside. Warm 3 tablespoons olive oil in a large skillet over medium-high heat. Stir in chicken, and season with salt, pepper, and garlic powder. Cook until chicken is cooked through and browned, about 5 minutes. Remove chicken to paper towels. Pour chicken broth into the skillet. Then stir in asparagus, garlic, and a pinch more garlic powder, salt, and pepper. Cover, and steam until the asparagus is just tender, about 5 to 10 minutes. Return chicken to the skillet, and warm through. Stir chicken mixture into pasta, and mix well. Let sit about 5 minutes. Drizzle with 2 tablespoons olive oil, stir again, then sprinkle with Parmesan cheese.",
        "creatorId":-1
    },
    {
        "id":312,
        "name":"Easy Pizza Sauce III",
        "instructions":"In a medium bowl, Mix together tomato sauce and tomato paste until smooth. Stir in oregano, garlic and paprika.",
        "creatorId":-1
    },
    {
        "id":313,
        "name":"Best Beef Enchiladas",
        "instructions":"Preheat oven to 350 degrees F (175 degrees C). Cook and stir ground beef with onion in a skillet over medium heat until meat is crumbly and no longer pink, about 10 minutes. Drain grease. Stir 1 cup Cheddar cheese, sour cream, parsley,  , oregano, and black pepper into the ground beef until cheese has melted. Mix in enchilada sauce, chili powder, garlic, and salt; bring to a simmer, reduce heat to low, and simmer until meat sauce is slightly thickened, about 5 minutes. Lay a tortilla onto a work surface and spoon about 1\/4 cup of meat sauce down the center of the tortilla. Top meat sauce with 1 tablespoon black beans and a sprinkling of black olives. Roll the tortilla up, enclosing the filling, and lay seam-side down into a 9x13-inch baking dish. Repeat with remaining tortillas. Spoon any remaining meat sauce over the enchiladas and scatter any remaining black beans and black olives over the top. Sprinkle tortillas with 1\/4 cup Cheddar cheese. Bake in the preheated oven until cheese topping is melted and enchiladas and sauce are bubbling, 20 to 22 minutes. Let stand 5 minutes before serving.",
        "creatorId":-1
    }
]
